{
   "BFSI (Banking, NBFCs, Stock Broking,":{
      "Tier 1":[
         "Do you have a centralized AI strategy aligned with overall business goals?",
         "Are AI models integrated into your core banking or insurance platforms?",
         "Do you use AI for real-time fraud detection across digital channels?",
         "Is customer segmentation powered by AI-driven behavioral analytics?",
         "Have you implemented AI chatbots across all service verticals?",
         "Do you utilize AI for underwriting in insurance or loan approvals?",
         "Is AI used for predictive analytics in risk management?",
         "Do you have a dedicated AI team within your IT or innovation department?",
         "Are AI models audited for fairness, bias, and compliance?",
         "Do you use AI for real-time personalization of customer offerings?",
         "Have you implemented AI in algorithmic trading or wealth management?",
         "Is customer sentiment analyzed using AI tools in social channels?",
         "Do you have AI-based customer churn prediction in place?",
         "Are you measuring ROI from AI initiatives on a quarterly basis?",
         "Is AI used for compliance and regulatory reporting automation?",
         "Are you leveraging AI to forecast market shifts and economic trends?",
         "Do you have AI-driven credit scoring systems?",
         "Is your organization training internal staff on AI tools and ethics?",
         "Are you using AI to dynamically price insurance products?",
         "Are AI use cases regularly evaluated for scalability across departments?"
      ],
      "Tier 2":[
         "Do you build or provide AI solutions specifically for BFSI clients?",
         "Are your AI products compliant with financial sector regulations?",
         "Do your AI tools offer plug-and-play integrations for banks or insurers?",
         "Have your AI models been tested for bias in loan and insurance domains?",
         "Do you have AI-powered solutions for document processing in BFSI?",
         "Are your clients using your tools for fraud detection or anomaly monitoring?",
         "Is your AI solution used in client-facing digital channels (chatbots, apps)?",
         "Do you assist clients in measuring the ROI of AI deployments?",
         "Do you offer customized AI training programs for financial institutions?",
         "Do your tools support multiple languages or regional financial regulations?",
         "Are your solutions deployed on clients’ cloud/on-premise infrastructure",
         "Do you help BFSI clients track AI model drift over time?",
         "Are you providing AI solutions for hyper-personalization in BFSI?",
         "Is your AI used to automate regulatory compliance and reporting?",
         "Do you offer client-specific tuning of your AI models?",
         "Do you provide pre-built BFSI datasets for model training?",
         "Do your AI tools help clients reduce operational costs?",
         "Do you provide dashboards for real-time AI performance tracking?",
         "Are your tools modular enough to scale across client verticals?",
         "Do you help clients optimize AI models post-deployment?"
      ],
      "Tier 3":[
         "Do you currently use any AI tools in customer support or service?",
         "Have you evaluated the feasibility of AI for fraud detection or credit scoring?",
         "Are you collecting and organizing structured and unstructured financial data?",
         "Do you have a roadmap for integrating AI into key business functions?",
         "Have you considered using AI for automated document verification?",
         "Are you piloting AI chatbots for basic customer queries?",
         "Is your team exploring predictive analytics for sales and risk insights?",
         "Do you have access to internal or external AI expertise?",
         "Are you investing in staff training on data and AI literacy?",
         "Are you measuring the impact of your initial AI implementations?",
         "Do you have compliance processes in place for any AI use?",
         "Are you collaborating with external partners on AI pilots?",
         "Do you use dashboards for monitoring operational performance and AI metrics?",
         "Is AI discussed in strategic planning meetings?",
         "Do you have an internal AI advocate or leader?",
         "Are you considering AI for marketing automation and lead scoring?",
         "Have you documented AI-related risks and ethics?",
         "Are you evaluating cloud-based AI platforms for deployment?",
         "Is your customer feedback loop integrated into future AI planning?",
         "Do you plan to scale successful AI pilots across departments?"
      ],
      "Tier 4":[
         "Are you aware of AI’s potential in your BFSI niche?",
         "Are you collecting digital data that could support AI models?",
         "Have you explored low-code or no-code AI tools for experimentation?",
         "Do you use rule-based automation in operations?",
         "Are you using any public datasets to build prototypes or POCs?",
         "Are you exploring AI for customer engagement (e.g., email/chat)?",
         "Are you using cloud services that support AI integration?",
         "Do you track operational pain points that AI could solve?",
         "Are you attending BFSI or AI innovation events to stay current?",
         "Have you considered partnerships with AI startups or researchers?",
         "Is your management interested in investing in AI over the next year?",
         "Are you familiar with open-source AI tools?",
         "Have you identified a few priority areas where AI can create value?",
         "Are you aware of government or institutional AI funding schemes?",
         "Do you track how competitors are using AI?",
         "Are you exploring automation in KYC or onboarding processes?",
         "Have you evaluated AI options for customer analytics?",
         "Are you leveraging APIs or AI-as-a-service offerings?",
         "Have you done any internal brainstorming for AI ideas?",
         "Do you see AI as a long-term strategic advantage in BFSI?"
      ],
      "Tier 5":[
         "Are you offering AI consulting or services specifically for BFSI clients?",
         "Do you have experience building models for fraud detection, scoring, or trading?",
         "Do you stay updated on BFSI regulations affecting AI deployment?",
         "Do you use secure cloud platforms for your AI work in finance?",
         "Have you built or used models that handle financial time-series data?",
         "Are you familiar with bias mitigation in credit scoring models?",
         "Do you offer AI services for financial document processing?",
         "Do you contribute to open-source AI tools for BFSI applications?",
         "Are you marketing your AI skills to BFSI clients (banks, NBFCs, etc.)?",
         "Are you using ML pipelines for rapid prototyping in BFSI use cases?",
         "Do you offer AI services for chatbots, CRM, or marketing in finance?",
         "Have you worked with OCR/NLP models for regulatory reporting?",
         "Are you building AI models using anonymized BFSI data responsibly?",
         "Do you understand how to interpret financial AI model outputs for business",
         "Are you upskilling regularly on BFSI-focused AI trends and tools?",
         "Are you part of any community or network focused on AI in BFSI?",
         "Do you provide pre-trained BFSI models to your clients?",
         "Do you freelance for AI tasks like credit modeling or sentiment analysis?",
         "Are you familiar with BFSI cybersecurity implications for AI use?",
         "Have you created any BFSI-specific AI tools or demos to showcase?"
      ]
   },
   "Manufacturing (Automobiles, Textiles,":{
      "Tier 1":[
         "Do you have a company-wide AI roadmap for smart manufacturing?",
         "Are AI systems integrated with your ERP, MES, and SCM platforms?",
         "Is predictive maintenance using AI fully operational on key assets?",
         "Are you using computer vision for quality control and defect detection?",
         "Is AI being used for demand forecasting and inventory optimization?",
         "Are you leveraging AI for energy consumption and cost optimization?",
         "Do you use digital twins with real-time AI analytics?",
         "Is AI embedded in your supply chain risk management strategy?",
         "Do you apply AI for dynamic pricing of manufacturing outputs?",
         "Are AI models used to optimize plant layout and operations?",
         "Do you measure the ROI of AI implementations across factories?",
         "Is your workforce regularly trained on AI tools and safety standards?",
         "Are robotic systems enhanced with AI for adaptive automation?",
         "Are AI-driven insights shared across departments in real-time?",
         "Are AI models retrained using live production data?",
         "Do you use AI for sustainability metrics and carbon footprint tracking?",
         "Are you conducting AI audits for compliance and explainability?",
         "Is AI integrated into your new product development pipeline?",
         "Are you running AI innovation labs or pilots with external startups?",
         "Are you a part of any global AI manufacturing alliances or initiatives?"
      ],
      "Tier 2":[
         "Do your AI solutions integrate easily with PLCs, ERPs, and MES systems?",
         "Are your AI models trained on real-world manufacturing datasets?",
         "Do you provide AI-driven predictive maintenance or quality control tools?",
         "Are your solutions compliant with industrial safety and cybersecurity standards?",
         "Do you offer explainable AI for decision-makers in manufacturing?",
         "Are your AI dashboards used by clients for real-time monitoring?",
         "Do you offer integration with IoT devices and sensors?",
         "Can your AI tools support multiple manufacturing verticals (automobile, textile)?",
         "Do you conduct POCs or pilot projects with Tier 1 manufacturers?",
         "Are your AI systems designed for high-availability and low-latency use?",
         "Do you support clients in deploying AI across multiple plants or locations?",
         "Are your AI algorithms continuously updated based on client usage?",
         "Do you provide documentation and training for client-side AI teams?",
         "Is AI part of your end-to-end digital transformation offerings?",
         "Do you offer SLA-backed support for AI tools in critical manufacturing ops?",
         "Are your solutions certified for use in regulated manufacturing sectors?",
         "Are you enabling clients to comply with ESG or green manufacturing standards?",
         "Do you provide custom AI development or model fine-tuning?",
         "Is your solution modular for selective feature deployment (vision, NLP,",
         "Do you collect and publish success metrics for client AI adoption?"
      ],
      "Tier 3":[
         "Are you currently using any AI solutions in production or quality control?",
         "Have you evaluated vendors for predictive maintenance solutions?",
         "Are you digitizing shop floor data to enable AI analysis?",
         "Do you track KPIs that could be enhanced using AI tools?",
         "Are you considering AI for demand forecasting or procurement optimization?",
         "Do you have a pilot or POC in place using AI for defect detection?",
         "Is your team aware of AI’s potential in manufacturing?",
         "Are you investing in staff upskilling for data and AI fluency?",
         "Are you using any cloud-based tools that support AI use?",
         "Do you collaborate with consultants or vendors for AI adoption?",
         "Are you setting KPIs for AI pilots in manufacturing lines?",
         "Do you collect machine-level data suitable for AI modeling?",
         "Are you using AI to simulate production runs or process improvements?",
         "Have you documented pain points where AI can help reduce downtime?",
         "Are you preparing your data infrastructure for future AI scalability?",
         "Do you measure downtime or production loss due to manual errors?",
         "Are you planning to automate quality assurance with vision-based AI?",
         "Have you tested AI for anomaly detection in production metrics?",
         "Are you including AI goals in your yearly operational strategy?",
         "Do you foresee AI contributing to cost savings or waste reduction?"
      ],
      "Tier 4":[
         "Are you aware of affordable AI tools that can improve your processes?",
         "Do you collect basic machine or sensor data in digital form?",
         "Are you exploring AI to reduce scrap, waste, or defect rates?",
         "Have you tried using AI for machine fault predictions or alerts?",
         "Do you use Excel or basic dashboards for operational decisions?",
         "Are you attending any AI or smart manufacturing expos or events?",
         "Have you explored government schemes for digital manufacturing upgrades?",
         "Are you using computer vision or simple cameras on the shop floor?",
         "Have you tried prototyping with open-source AI tools?",
         "Are you planning to digitize legacy systems to make AI integration easier?",
         "Are you collaborating with local AI developers or freelancers?",
         "Have you considered automating repetitive inspection tasks using AI?",
         "Do you track metrics like equipment downtime or quality manually?",
         "Are you open to piloting AI tools offered by early-stage startups?",
         "Are you planning to centralize data storage from machines or departments?",
         "Do you measure customer feedback that could guide production quality",
         "Are you planning to hire or outsource AI expertise in the next year?",
         "Are you using any ERP/CRM system with built-in AI capabilities?",
         "Are you leveraging any low-code AI apps for productivity?",
         "Do you see AI as a differentiator in your product quality or delivery?"
      ],
      "Tier 5":[
         "Do you work with manufacturing clients on AI-based automation solutions?",
         "Have you developed or fine-tuned computer vision models for defect detection?",
         "Are you using synthetic data generation for limited datasets in industrial AI?",
         "Have you worked with sensor data from PLCs or SCADA systems?",
         "Do you build predictive models for equipment maintenance?",
         "Are you familiar with AI model deployment in edge/industrial environments?",
         "Have you consulted on energy optimization using AI in factories?",
         "Do you offer simulation or digital twin services using AI?",
         "Have you deployed AI for real-time inventory or logistics decisions?",
         "Are you upskilling on AI tools specific to industrial automation (e.g., Siemens,",
         "Do you offer AI consultation for lean manufacturing or Six Sigma integration?",
         "Are you contributing to open-source manufacturing AI libraries or benchmarks?",
         "Do you use frameworks like PyTorch, TensorFlow, or ONNX for edge",
         "Are you familiar with the unique cybersecurity considerations in smart factories?",
         "Have you integrated AI models with ERP or SAP systems?",
         "Are you presenting AI solutions at manufacturing tech expos or webinars?",
         "Have you created demo models showcasing production line optimization?",
         "Are you building explainable models for compliance and user trust?",
         "Do you offer visualization dashboards for real-time monitoring in plants?",
         "Are you building a portfolio of reusable AI assets for industrial use cases?"
      ]
   },
   "Healthcare (Hospitals, Clinics, Diagnostics,":{
      "Tier 1":[
         "Do you have an enterprise-wide AI strategy aligned with digital health",
         "Is AI integrated across your EHR, PACS, and hospital information systems?",
         "Are clinical decisions augmented with AI diagnostics and decision support",
         "Do you use AI for real-time patient monitoring and early alert systems?",
         "Are AI models used for predictive analytics in patient readmission or outcomes?",
         "Do you apply AI in optimizing treatment plans and precision medicine?",
         "Are AI solutions part of clinical trials or drug discovery pipelines?",
         "Do you integrate AI for hospital resource planning (beds, ICUs, staff)?",
         "Are AI models trained and retrained with diverse and anonymized patient data?",
         "Is your AI usage compliant with HIPAA, GDPR, or local data protection",
         "Do you run regular AI audits for ethical use and bias reduction?",
         "Are virtual health assistants or AI-powered chatbots deployed for patient",
         "Are you leveraging AI for cost optimization in insurance claims or billing?",
         "Do you assess ROI for AI deployments in clinical and operational settings?",
         "Is AI integrated with IoT devices for remote patient care and monitoring?",
         "Do you collaborate with health tech startups and research labs for AI",
         "Are you leveraging federated learning for secure AI training across hospitals?",
         "Do you use AI to predict and manage disease outbreaks or public health trends?",
         "Are AI insights integrated into personalized patient experience journeys?",
         "Are you publishing AI research or contributing to open medical AI datasets?"
      ],
      "Tier 2":[
         "Are your AI solutions approved or certified for clinical use (e.g., FDA, CE)?",
         "Do you provide explainable AI tools for doctors and hospital admins?",
         "Are your AI models trained on diverse, inclusive medical datasets?",
         "Do your solutions integrate with leading EHR systems (Epic, Cerner, etc.)?",
         "Do you offer support for real-time decision-making in critical care?",
         "Can your AI tools scale across multispecialty hospital chains or networks?",
         "Do you enable clients to measure clinical and operational ROI of AI?",
         "Are your AI tools compliant with HIPAA, HL7, and DICOM standards?",
         "Do you support federated learning or privacy-preserving AI methods?",
         "Do you provide post-deployment support, model updates, and training?",
         "Are your AI diagnostics validated through peer-reviewed studies?",
         "Can your AI tools be embedded into mobile health or telemedicine platforms?",
         "Do you provide patient-facing AI services (e.g., symptom checkers)?",
         "Are your tools designed for multilingual, low-bandwidth environments?",
         "Do you support data integration from wearable and IoMT devices?",
         "Are you participating in healthcare AI consortiums or public health partnerships?",
         "Do you provide white-label AI for insurance providers or TPAs?",
         "Are your products modular for selective deployment across departments?",
         "Do you offer APIs for fast AI deployment by healthcare developers?",
         "Do you assist clients with AI risk mitigation, bias testing, and compliance?"
      ],
      "Tier 3":[
         "Are you using AI-based diagnostics for radiology, pathology, or dermatology?",
         "Do you use AI to predict appointment no-shows or resource utilization?",
         "Are you exploring AI-powered chatbots for front desk automation?",
         "Do you use predictive analytics for managing patient inflow during peak periods?",
         "Are your staff trained to interact with or validate AI outputs?",
         "Are AI tools integrated with your billing or insurance claim systems?",
         "Do you partner with vendors for AI trials or pilots in your hospital?",
         "Are you digitizing legacy data to prepare for AI implementation?",
         "Do you use AI to optimize pharmacy inventory or procurement?",
         "Are you evaluating AI for chronic disease management or home care?",
         "Do you analyze clinical data to improve quality of care with AI?",
         "Are you collaborating with health tech companies for innovation?",
         "Do you have IT infrastructure capable of supporting AI workloads?",
         "Are you monitoring and measuring the performance of AI tools you use?",
         "Are you using telehealth or remote monitoring integrated with AI insights?",
         "Do you use AI for triage or case prioritization in OPD/IPD?",
         "Are you using basic machine learning models for patient segmentation?",
         "Are you identifying funding or grants for AI health innovation?",
         "Are you including AI milestones in your digital transformation roadmap?",
         "Do you maintain anonymized clinical data for AI research or pilots?"
      ],
      "Tier 4":[
         "Have you developed or deployed AI solutions for diagnostics or workflows?",
         "Are you piloting AI with partner clinics or diagnostic centers?",
         "Do you train AI models using open or synthetic medical datasets?",
         "Are you using AI for automating repetitive documentation tasks?",
         "Have you considered AI for optimizing health insurance claim validation?",
         "Are you building NLP models to extract insights from unstructured clinical text?",
         "Are you exploring use cases like AI in medical transcription or voice notes?",
         "Are your AI tools mobile-friendly and usable in low-resource settings?",
         "Are you offering AI solutions for telemedicine or remote triage?",
         "Have you partnered with hospitals or labs to co-develop AI models?",
         "Are you conducting small-scale trials to validate your AI’s clinical accuracy?",
         "Do you provide end-to-end services (data prep, model training, compliance)?",
         "Are you using edge AI or lightweight models for low-power medical devices?",
         "Are you incorporating patient consent and privacy features into your apps?",
         "Do you collect patient feedback to improve your AI tools?",
         "Are you engaging with medical advisors to validate AI use cases?",
         "Do you follow a framework for AI fairness and transparency in healthcare?",
         "Are you applying for health tech incubators or government support?",
         "Are you tracking clinical KPIs improved via your AI tools?",
         "Are you preparing clinical documentation to support AI certification?"
      ],
      "Tier 5":[
         "Do you work with healthcare data like EHRs, lab reports, or imaging?",
         "Are you building or fine-tuning AI models for diagnostics or drug discovery?",
         "Have you worked on AI for medical NLP (discharge summaries, notes)?",
         "Are you using de-identified or open datasets (MIMIC, PhysioNet) for model",
         "Are you familiar with medical imaging tools (DICOM, Nifti, PACS)?",
         "Have you built patient triage systems using rule-based or AI models?",
         "Do you understand the regulatory standards for medical AI (HIPAA, FDA)?",
         "Are you contributing to open-source medical AI libraries or benchmarks?",
         "Have you developed tools to assist radiologists, pathologists, or general",
         "Are you exploring federated learning to train models without data movement?",
         "Do you publish in medical AI or health informatics forums?",
         "Are you collaborating with doctors or researchers for validation?",
         "Have you developed explainable models for medical use cases?",
         "Do you build or contribute to visual dashboards for patient insights?",
         "Have you worked on clinical decision support systems using AI?",
         "Are you integrating AI models into hospital or mobile health apps?",
         "Are you addressing AI bias and fairness in medical datasets?",
         "Do you offer services in OCR, chatbot development, or symptom triage?",
         "Are you customizing AI for multilingual healthcare delivery?",
         "Have you designed AI-based early warning systems or alerts for patient care?"
      ]
   },
   "Hospitality":{
      "Tier 1":[
         "Do you have an enterprise-wide AI strategy to enhance guest experience and",
         "Is AI integrated into your Property Management System (PMS) and CRM for",
         "Do you use AI for dynamic pricing, demand forecasting, and yield management?",
         "Are AI-powered chatbots deployed across all guest communication channels",
         "Is your AI able to analyze customer sentiment from feedback, reviews, and",
         "Are AI recommendations personalized for each guest across booking, dining,",
         "Is facial recognition or biometric-based check-in implemented across",
         "Do you use AI for predictive maintenance across facilities (AC, lighting,",
         "Is AI leveraged to track food inventory, reduce waste, and optimize",
         "Do you integrate AI with loyalty programs to enhance retention and upselling?",
         "Is AI used for staff scheduling and workload optimization across shifts?",
         "Are you using AI to identify high-value customers and tailor marketing efforts?",
         "Do you integrate smart room automation (IoT + AI) for guest personalization?",
         "Are you able to predict guest churn or dissatisfaction using AI models?",
         "Do you track ROI on AI-driven guest engagement, bookings, and conversions?",
         "Are you partnering with AI startups or universities for innovation pilots?",
         "Are multilingual, voice-based AI services deployed for global guests?",
         "Are AI tools used to dynamically adjust menus or pricing in restaurants?",
         "Are you utilizing digital twins or simulations to improve guest operations?",
         "Do you use AI for demand forecasting during events, seasons, or travel spikes?"
      ],
      "Tier 2":[
         "Do your AI products integrate seamlessly with PMS, RMS, and CRM platforms?",
         "Do you offer NLP-driven guest chatbots that learn and adapt from interactions?",
         "Can your AI engine segment guests and personalize offers in real time?",
         "Are your tools compliant with GDPR, PCI DSS, and hospitality data standards?",
         "Do you provide AI-enabled dynamic pricing or rate optimization engines?",
         "Do your solutions support multilingual guest support and localization?",
         "Do you offer facial recognition and AI-enhanced identity verification tools?",
         "Are your tools tested for hospitality-specific KPIs (RevPAR, ADR, GOP)?",
         "Do you enable predictive maintenance and smart facility management?",
         "Can your AI integrate with smart room devices for automation?",
         "Do you provide insights dashboards using AI-generated forecasts?",
         "Are your AI models trained on diverse hospitality datasets (booking, reviews)?",
         "Do you offer computer vision solutions for queue management or security?",
         "Can your systems learn from guest preferences to suggest services/offers?",
         "Are you enabling voice AI for in-room assistance and concierge services?",
         "Do you provide AI for menu personalization or F&B optimization?",
         "Are your AI tools explainable, auditable, and tunable by clients?",
         "Do you support deployment across cloud, edge, and hybrid environments?",
         "Do you offer APIs for integration with booking engines and travel aggregators?",
         "Do you provide training, certification, and support for hospitality staff using your"
      ],
      "Tier 3":[
         "Do you use AI chatbots for answering FAQs and handling bookings on your",
         "Are you exploring AI for demand forecasting and pricing during peak seasons?",
         "Do you segment guests based on past preferences using AI or ML?",
         "Are AI models helping reduce food wastage in your kitchens or buffets?",
         "Do you monitor online reviews using AI sentiment analysis tools?",
         "Are you using AI to analyze competitor pricing and guest behavior?",
         "Do you use AI to send targeted promotions via email or SMS?",
         "Are you integrating AI into your CRM to improve personalization?",
         "Do you use voice-based or touchscreen kiosks powered by AI for check-in?",
         "Are smart devices in your rooms connected to AI to learn guest habits?",
         "Are you using AI for staff performance and scheduling analytics?",
         "Do you collect data on guest feedback and process it through AI?",
         "Are AI tools integrated with your online reservation and POS systems?",
         "Do you track energy consumption or maintenance alerts using AI?",
         "Are you exploring NLP tools to automatically respond to reviews/messages?",
         "Are your managers trained in understanding insights from AI dashboards?",
         "Do you calculate revenue uplift or cost savings from any AI deployments?",
         "Are you testing or piloting new AI tools from vendors/startups?",
         "Do you support virtual concierges or app-based guest services with AI?",
         "Are AI tools used for event planning, space management, or table bookings?"
      ],
      "Tier 4":[
         "Are you using AI-powered chatbots or virtual concierges for bookings or queries?",
         "Have you implemented recommendation engines for rooms, food, or",
         "Are you using AI to reduce no-shows or cancellations via predictive models?",
         "Do you analyze guest reviews automatically to identify service gaps?",
         "Are you using AI to optimize restaurant menus or pricing?",
         "Have you deployed AI-based tools for multilingual guest support?",
         "Are AI systems in place for staff scheduling or customer wait-time management?",
         "Do you personalize offers based on past behavior using AI?",
         "Are you exploring visual search for property discovery or decor styles?",
         "Have you built or deployed lightweight AI apps for operations or marketing?",
         "Do you have partnerships with AI vendors for trials or early access programs?",
         "Are you tracking the success of AI features via key metrics (booking rates,",
         "Do you conduct A/B tests for AI-generated content or campaigns?",
         "Have you experimented with AI-generated videos or social media content?",
         "Are AI tools used to forecast occupancy or kitchen stock levels?",
         "Are your solutions cloud-hosted and scalable with business growth?",
         "Have you trained models using local data (menus, guest profiles, etc.)?",
         "Are you training staff to interpret or support AI systems?",
         "Do you provide mobile-first, AI-powered guest experiences?",
         "Are AI insights used in your business development or expansion decisions?"
      ],
      "Tier 5":[
         "Have you worked on hospitality data (bookings, reviews, menus, CRM)?",
         "Have you created chatbots for hospitality businesses?",
         "Do you use NLP to analyze customer reviews or queries?",
         "Have you built recommendation engines for hotels or food delivery?",
         "Do you provide AI services for personalized pricing or loyalty offers?",
         "Are you familiar with hospitality-specific KPIs like ADR, RevPAR, etc.?",
         "Have you worked with facial recognition or sentiment analysis for guest",
         "Have you trained models using data from Booking.com, TripAdvisor, or Yelp?",
         "Are you developing multilingual or voice-based AI solutions?",
         "Have you built mobile-first AI applications for guest management?",
         "Do you contribute to open datasets or repositories related to hospitality AI?",
         "Have you used LLMs for auto-responders in hospitality workflows?",
         "Have you implemented AI solutions for smart devices in hotel rooms?",
         "Have you built dashboards to visualize AI insights for owners or GMs?",
         "Have you trained AI models on restaurant or cafe data for optimization?",
         "Have you used image recognition to analyze room cleanliness or inventory?",
         "Do you offer generative AI services for hotel content or ads?",
         "Are you integrating AI with booking engines or aggregators?",
         "Do you provide AI workshops or consulting to boutique hotels or startups?",
         "Have you deployed AI tools to manage social media engagement for brands?"
      ]
   },
   "Pharma":{
      "Tier 1":[
         "Is AI integrated into your drug discovery pipeline to identify novel compounds",
         "Do you use machine learning models for predicting clinical trial outcomes?",
         "Is AI used in patient stratification and selection for clinical trials?",
         "Are you leveraging AI to identify and mitigate adverse drug reactions (ADR)?",
         "Do you utilize NLP for regulatory document automation and compliance?",
         "Is AI deployed in manufacturing to detect anomalies or ensure quality control?",
         "Do you use AI models to optimize supply chain logistics and cold chain",
         "Are AI-based tools used for pharmacovigilance and post-market surveillance?",
         "Have you implemented AI for early detection of fraud in medical claims or",
         "Is AI driving cost reductions in R&D through simulation and virtual trials?",
         "Do you integrate AI into sales and marketing analytics for physician targeting?",
         "Are you using AI to assess ROI from marketing campaigns and field rep",
         "Do you personalize physician and patient engagement using AI-driven insights?",
         "Are you partnering with AI research labs or healthtech startups for co-",
         "Are AI systems deployed to optimize inventory and anticipate demand surges?",
         "Do you use AI to analyze real-world evidence and generate new indications?",
         "Is AI involved in optimizing formulation, bioavailability, or compound stability?",
         "Are predictive models in place for regulatory or approval delays?",
         "Are you building proprietary AI datasets for long-term advantage?",
         "Are your AI initiatives aligned with global standards like GxP, HIPAA, and GDPR?"
      ],
      "Tier 2":[
         "Do your AI tools support pharma-specific use cases like drug target",
         "Can your models handle multi-omics data for biomarker discovery?",
         "Do you offer NLP capabilities to automate submission documentation (eCTD,",
         "Are your tools validated against FDA/EMA/ICH compliance requirements?",
         "Do you provide AI for real-time monitoring of adverse event signals?",
         "Can your solution support decentralized or virtual clinical trials?",
         "Is your AI capable of detecting counterfeits in the supply chain?",
         "Do you offer AI-powered CRM insights for field sales optimization?",
         "Are you providing AI models trained on diverse patient cohorts and trial data?",
         "Do you enable patient journey mapping using AI from EHR and wearable data?",
         "Are your solutions integrated with major platforms like SAP, Veeva, or Oracle?",
         "Can your platform detect process deviations in real-time during batch",
         "Do your AI systems support adaptive trial designs and interim analysis?",
         "Can you track molecule life cycles using AI-driven dashboards?",
         "Are you offering predictive analytics for raw material forecasting?",
         "Do you support document AI for SOPs, batch records, and CAPA automation?",
         "Are your systems validated for use in cGMP environments?",
         "Can clients explain and audit the outputs of your AI models?",
         "Are you able to demonstrate ROI or time savings for pharma clients?",
         "Do you offer sandbox environments for pharma to test your models securely?"
      ],
      "Tier 3":[
         "Do you use AI to improve efficiency in clinical trial planning or patient",
         "Is AI used for analyzing lab data or sample test results?",
         "Are you using machine learning to identify gaps in regulatory compliance?",
         "Do you automate pharmacovigilance reporting using NLP or classification",
         "Are AI tools helping reduce time spent on documentation and SOPs?",
         "Do you use AI to forecast raw material needs and supplier delays?",
         "Is AI used to generate market segmentation or demand prediction?",
         "Do you personalize physician outreach using AI analytics?",
         "Do you analyze competitor pipelines or research with AI-driven insights?",
         "Are you testing AI models for side effect prediction from real-world data?",
         "Do you evaluate the effectiveness of drugs post-approval using AI?",
         "Are you piloting AI in your manufacturing line for anomaly detection?",
         "Do you track the efficiency of field sales and MRs using AI dashboards?",
         "Is AI used in optimizing your packaging and serialization workflows?",
         "Have you automated any document review processes with AI?",
         "Are AI tools used to assess or improve clinical trial diversity?",
         "Do you use AI to recommend new indications or use cases for existing drugs?",
         "Are insights from AI influencing your go-to-market or expansion plans?",
         "Do you collect structured and unstructured data for AI model training?",
         "Are your teams trained on interpreting AI results in compliance-heavy"
      ],
      "Tier 4":[
         "Are you using AI to analyze scientific literature or patents for R&D?",
         "Have you implemented NLP models for adverse event reporting?",
         "Are AI tools deployed to design or test chemical structures virtually?",
         "Do you personalize content for HCPs using data-driven recommendations?",
         "Have you built chatbots or virtual assistants for patient engagement?",
         "Are you piloting AI to predict shelf life or formulation stability?",
         "Are you experimenting with predictive models for regulatory timelines?",
         "Do you use AI to cluster or classify trial participants?",
         "Are you collecting feedback or usage data to improve your AI models?",
         "Are you applying image recognition for quality inspection in labs or packaging?",
         "Are you creating dashboards that combine clinical, marketing, and sales AI",
         "Are you participating in AI-for-health hackathons or collaborations?",
         "Do you use AI to analyze patient adherence or drop-off patterns?",
         "Are your AI models trained on open-source pharma datasets?",
         "Have you submitted any AI tools for validation to pharma regulators?",
         "Are you experimenting with real-world data or EHRs for insights?",
         "Have you used AI to support grant writing or pitch decks?",
         "Are you building solutions on cloud platforms like AWS, Azure, or GCP?",
         "Are you continuously refining AI models based on pilot results?",
         "Have you started monetizing any of your AI pharma tools or IP?"
      ],
      "Tier 5":[
         "Have you built ML models for compound activity prediction or QSAR?",
         "Have you used AI to analyze PubMed, patents, or trial datasets?",
         "Do you work with biomedical NLP for text mining in pharma research?",
         "Have you contributed to drug discovery or repurposing projects using AI?",
         "Have you created predictive models for ADMET properties?",
         "Are you familiar with pharma-specific datasets like ChEMBL, DrugBank, etc.?",
         "Do you offer AI tools or dashboards to CROs or clinical trial teams?",
         "Have you worked with pharmaceutical CRMs or ERP systems?",
         "Are you applying image recognition in microscopic or lab data analysis?",
         "Do you consult for pharmacovigilance automation using AI?",
         "Are you building LLM-based summarizers for regulatory or trial documents?",
         "Do you offer analytics for pharma marketing or MR performance?",
         "Have you worked with EHR data for drug effectiveness or safety analysis?",
         "Are you skilled in integrating structured + unstructured health data?",
         "Have you created solutions using Graph ML for drug-target interactions?",
         "Do you consult or build prototypes for AI in biotech startups?",
         "Do you publish or blog about AI in pharma applications?",
         "Do you contribute to open-source tools for pharma AI?",
         "Have you helped train pharma teams on AI awareness or use?",
         "Do you support compliance teams in validating AI tools or pipelines?"
      ]
   },
   "Travel & Tourism":{
      "Tier 1":[
         "Do you use AI for hyper-personalized travel recommendations across platforms?",
         "Is AI embedded in your dynamic pricing engines for flights, hotels, and",
         "Are customer service bots powered by NLP and available 24/7 in multiple",
         "Is AI used to forecast seasonal demand and optimize resource allocation?",
         "Are you leveraging AI to detect and prevent fraudulent bookings or transactions?",
         "Are AI-based sentiment analysis tools used to refine your service offerings?",
         "Is AI helping optimize customer acquisition cost through behavioral targeting?",
         "Do your recommendation engines leverage multimodal customer data?",
         "Are AI-driven itinerary builders integrated into your user experience?",
         "Are predictive models used to identify high-LTV (lifetime value) customers?",
         "Is computer vision used for automated check-in or facial recognition?",
         "Are you analyzing travel data to identify new route or property opportunities?",
         "Is AI used to optimize loyalty program offerings in real time?",
         "Do you use voice-based AI interfaces (e.g., for bookings or customer support)?",
         "Are multilingual AI models enhancing global customer interactions?",
         "Are operational decisions driven by real-time AI forecasts (e.g., staffing, delays)?",
         "Do AI tools help with customer churn prediction and win-back strategies?",
         "Are AI-powered systems integrated into your CRM and marketing stack?",
         "Are you tracking and optimizing carbon footprint using AI tools?",
         "Do your AI systems comply with global privacy regulations (GDPR, CCPA)?"
      ],
      "Tier 2":[
         "Do your AI tools support personalization for travel websites and booking",
         "Can your models perform real-time price comparison and prediction?",
         "Are your systems capable of processing multilingual travel reviews using NLP?",
         "Do you support fraud detection and chargeback prevention using AI?",
         "Do you enable hotel chains or airlines to automate guest messaging and",
         "Are your AI tools trained on structured and unstructured travel data?",
         "Can your solutions assist in optimizing route planning or fleet management?",
         "Are AI dashboards available to analyze booking behavior and customer profiles?",
         "Do you integrate with major GDS and OTA platforms using AI insights?",
         "Are AI-driven recommendation engines part of your product offerings?",
         "Can your tools detect fake reviews or user-generated content?",
         "Do your AI tools support upselling or cross-selling during bookings?",
         "Do you provide plug-and-play chatbot tools for travel agents or portals?",
         "Are you helping clients automate itinerary suggestions or travel advisories?",
         "Can your AI engine predict cancellation probability or no-shows?",
         "Do you offer voice and image search capabilities for travel platforms?",
         "Can your systems cluster tourists by preferences and past travel behavior?",
         "Do you offer predictive demand and occupancy forecasting tools?",
         "Are your AI offerings GDPR and PCI compliant?",
         "Are clients able to customize and retrain your AI modules for local needs?"
      ],
      "Tier 3":[
         "Are you using AI to recommend packages based on user search patterns?",
         "Is AI used to analyze customer reviews and ratings for feedback?",
         "Have you automated parts of your booking workflow using AI or RPA?",
         "Do you use AI to segment users for targeted marketing campaigns?",
         "Is AI helping you optimize room or seat pricing in real-time?",
         "Are you experimenting with AI for voice-enabled bookings or queries?",
         "Are AI insights used in planning future campaigns or destinations?",
         "Are you predicting cancellations or booking modifications with AI?",
         "Do you analyze tourist behavior post-travel for loyalty planning?",
         "Are AI-powered assistants helping reduce wait times or queue lengths?",
         "Is AI used to dynamically adjust promotions or coupons?",
         "Do you use AI models to anticipate travel trends or seasonality?",
         "Are you monitoring social media for sentiment around your services?",
         "Do you use AI for competitor pricing intelligence?",
         "Is your CRM enriched using AI-generated customer profiles?",
         "Are AI models applied for route or tour guide optimization?",
         "Do you recommend travel add-ons like insurance or excursions using AI?",
         "Are you tracking customer engagement with AI-fueled analytics?",
         "Are you working with partners or startups offering AI tools for travel?",
         "Are you testing AI-powered fraud detection for bookings or payments?"
      ],
      "Tier 4":[
         "Are you building AI-based recommendation tools for trip planning?",
         "Are you using chatbot tools for real-time customer interaction?",
         "Are AI models used to personalize email campaigns or offers?",
         "Do you analyze customer complaints using NLP to improve services?",
         "Are you testing price prediction tools for hotel or ticket booking?",
         "Is AI helping identify the best times to promote deals or send notifications?",
         "Are you scraping data using AI for travel trends and competitor benchmarking?",
         "Are you experimenting with AI for demand forecasting?",
         "Do you use AI to analyze footfall and traveler data at destinations?",
         "Are you integrating voice commands or assistants in your app?",
         "Are you using AI to enhance the travel experience with local recommendations?",
         "Have you used image recognition for trip categorization or media tagging?",
         "Are you analyzing refund requests or cancellations with AI models?",
         "Do you use AI to rate and rank customer experiences automatically?",
         "Are you collaborating with influencers using AI analytics?",
         "Are you using AI to A/B test content or UI on your website?",
         "Are you building APIs or plugins powered by AI for third-party use?",
         "Do you analyze customer loyalty or referral behaviors using AI?",
         "Are you tracking campaign ROI using AI-enhanced dashboards?",
         "Are you considering AR/VR integrations with AI for virtual tours?"
      ],
      "Tier 5":[
         "Have you developed travel recommender systems using collaborative filtering or",
         "Have you built dynamic pricing or fare prediction models?",
         "Have you trained chatbots for tourism boards or hotel chains?",
         "Are you scraping travel data to build predictive analytics tools?",
         "Have you worked on NLP models for analyzing customer reviews or queries?",
         "Do you consult on AI integration in travel platforms or OTAs?",
         "Have you built voice assistant skills for travel booking or information?",
         "Do you experiment with clustering traveler personas using AI?",
         "Are you offering location-based services enhanced with machine learning?",
         "Have you worked on image classification for tourist spots or UGC?",
         "Do you use AI to detect anomalies or fraud in booking data?",
         "Are you contributing to travel datasets or open-source models?",
         "Do you write blogs or tutorials about AI in tourism and hospitality?",
         "Are you offering workshops or consulting for AI in travel startups?",
         "Have you worked with facial recognition or CV for airports or hotels?",
         "Are you building dashboards with AI metrics for travel agencies?",
         "Have you developed personalization engines for tour operators?",
         "Do you apply AI to optimize SEO/SEM for travel platforms?",
         "Have you supported social media analytics for travel brands?",
         "Do you build or contribute to AI-based itinerary planners?"
      ]
   },
   "Education & EdTech":{
      "Tier 1":[
         "How integrated is AI in your personalized learning platforms?",
         "Do you use predictive analytics to improve student retention or performance?",
         "How mature is your AI-powered student feedback and evaluation system?",
         "Are faculty and staff regularly trained in emerging AI teaching tools?",
         "Do you use AI for administrative process automation (e.g., admissions, grading)?",
         "Have you deployed AI chatbots or virtual assistants for student services?",
         "What AI strategies are in place for curriculum personalization at scale?",
         "How do you ensure ethical AI use in student assessment and profiling?",
         "Is your data infrastructure optimized for real-time AI analytics across",
         "Do you track ROI from AI-enhanced education delivery?",
         "Are you leveraging AI in virtual or augmented reality-based learning?",
         "How do you evaluate and scale successful AI pilot projects?",
         "Are AI tools used in teacher performance analytics or development?",
         "Do you integrate external AI APIs or edtech tools into your LMS?",
         "What frameworks are in place for safeguarding student data in AI systems?",
         "Are industry collaborations used to co-develop AI learning modules?",
         "Is there a roadmap for introducing generative AI into course content creation?",
         "Do you run AI literacy programs for all stakeholders (students, faculty, admins)?",
         "How does AI inform your institutional strategic planning?",
         "Is AI being used to forecast future skill demands and adapt curricula?"
      ],
      "Tier 2":[
         "Do your edtech products support adaptive learning powered by AI?",
         "How robust is your AI architecture to handle multi-institution deployments?",
         "Are partner institutions involved in co-developing AI models or use cases?",
         "How is AI used to track learner engagement and provide real-time feedback?",
         "What safeguards do you offer against algorithmic bias in student data?",
         "Is your AI capable of multi-language and cultural learning adaptation?",
         "Do you provide AI tools for academic fraud detection?",
         "Are you offering AI-powered content recommendation engines?",
         "How is AI integrated into your cloud-based LMS or SIS?",
         "Do you benchmark AI outcomes with global EdTech standards?",
         "What’s your process for continuously updating your AI model datasets?",
         "Are you providing AI-powered analytics dashboards for educational institutions?",
         "How do you align your AI use cases with NEP (National Education Policy)?",
         "Are there APIs to integrate with third-party AI or ML systems?",
         "What’s your compliance mechanism for AI transparency in education?",
         "How scalable is your AI infrastructure for large education networks?",
         "Do your tools include generative AI for quiz/test/assignment creation?",
         "Is your team skilled in the latest AI research in education?",
         "How do you measure AI’s contribution to learning outcomes?",
         "Do you participate in international AI and education innovation forums?"
      ],
      "Tier 3":[
         "Have you identified key academic or admin areas for AI intervention?",
         "Do you use AI to analyze student behavior and personalize learning paths?",
         "Are AI tools used to automate administrative reporting?",
         "How effective is your data collection process for AI training?",
         "Have you piloted AI teaching assistants or tutors?",
         "Is your leadership aligned with long-term AI strategy in education?",
         "What steps have you taken to ensure student data security in AI use?",
         "Do you monitor AI model accuracy and fairness in grading or feedback?",
         "Is AI used to predict dropouts or academic at-risk students?",
         "Are faculty involved in training and using AI in course design?",
         "What LMS/ERP integrations exist for your AI tools?",
         "Is your AI infrastructure scalable for increased user adoption?",
         "Do you measure improvements in engagement or retention post-AI adoption?",
         "How do you gather feedback from users about AI experiences?",
         "Are you leveraging AI for hybrid or remote learning optimization?",
         "Is AI being used in internal skills gap analysis for students?",
         "Do you work with external AI partners for solution implementation?",
         "How is success from AI initiatives documented and shared internally?",
         "Are there AI features in your student communication systems?",
         "Do you use AI to improve course discoverability and recommendation?"
      ],
      "Tier 4":[
         "Does your core product offer AI-based value in education?",
         "What AI features distinguish you from competitors?",
         "Are your AI models regularly tested for bias or inaccuracy?",
         "How do you source and manage datasets for AI training?",
         "Is explainability built into your AI models for educators?",
         "Do you integrate AI APIs from third parties to enhance your app?",
         "Are your AI-based decisions auditable by institutions?",
         "Do you include student or teacher feedback to retrain AI models?",
         "What’s your approach to AI-powered gamification in learning?",
         "Is your architecture AI-ready and modular for rapid iteration?",
         "Are pilots of AI use cases part of your go-to-market strategy?",
         "Do you educate clients about the ROI and risks of AI features?",
         "How do you address ethical issues in AI learning platforms?",
         "Are there contingency plans if an AI module fails during operation?",
         "Is your team well-versed in education-focused AI tools or platforms?",
         "Have you raised funding specifically for AI development?",
         "Do you benchmark your AI features against industry standards?",
         "How responsive is your AI to evolving educational policy changes?",
         "Are you planning or building adaptive learning algorithms?",
         "How do you visualize AI insights for institutions using your platform?"
      ],
      "Tier 5":[
         "Have you used AI to build personalized tutoring solutions?",
         "Are you experimenting with generative AI for course or test creation?",
         "Do you use AI tools for video transcription, summarization, or translation?",
         "How do you incorporate AI into student engagement strategies?",
         "Are you using AI for resume review or career counseling in education?",
         "Do you apply AI models for grading or plagiarism detection?",
         "Are you trained in AI model selection and prompt engineering?",
         "Do you participate in EdTech AI communities or learning circles?",
         "What low-code/no-code AI tools have you explored for education?",
         "Are you familiar with ethical AI considerations in teaching?",
         "Do you use AI tools to automate documentation or reports?",
         "Is AI helping you create adaptive tests or learning content?",
         "Have you tried integrating AI into your freelance LMS platforms?",
         "Are you tracking the performance of AI use in your tutoring?",
         "How do you handle inaccuracies or hallucinations in AI output?",
         "Do you design your AI use cases around specific learner personas?",
         "Have you explored voice-based AI assistants in education?",
         "Do you have feedback loops in place to refine AI tools over time?",
         "Are you considering AI in your long-term business plans?",
         "How do you explain AI outcomes to non-technical students?"
      ]
   },
   "Retail & E-commerce":{
      "Tier 1":[
         "How extensively is AI used in your supply chain forecasting and inventory",
         "Is personalized product recommendation fully AI-driven across all customer",
         "How mature is your AI-powered dynamic pricing engine?",
         "Do you utilize AI for real-time customer segmentation and behavior analysis?",
         "Are AI chatbots integrated across all sales and support channels?",
         "How do you measure ROI from AI-driven personalization?",
         "Is AI used to detect fraud or anomalies in transaction data?",
         "Do you leverage computer vision AI for in-store or warehouse automation?",
         "How is AI integrated into your omnichannel marketing strategies?",
         "Do you have dedicated AI teams for product search optimization?",
         "Are AI tools used to forecast market demand and seasonal trends?",
         "What frameworks are in place to ensure AI-driven promotions are unbiased?",
         "Is sentiment analysis from social media integrated into your sales AI?",
         "How are generative AI tools used in product description or content generation?",
         "Are AI solutions aligned with your ESG/sustainability retail goals?",
         "Do you perform AI audits to assess fairness and transparency in",
         "How do you integrate AI across owned channels (app, web, in-store)?",
         "Are AI tools used for churn prediction and customer retention strategies?",
         "Do your AI models adapt in real-time to customer behavior changes?",
         "Is your retail data lake structured to power enterprise-scale AI insights?"
      ],
      "Tier 2":[
         "Does your platform offer embedded AI tools for personalization or analytics?",
         "Are you providing clients with AI-powered inventory management?",
         "How do you enable real-time AI integration across client e-commerce stores?",
         "Do you offer fraud detection AI modules for payments?",
         "Are AI algorithms tuned for vertical-specific product discovery?",
         "Do you support multilingual and multicultural AI personalization?",
         "How flexible is your AI system for client-specific customization?",
         "Do you help clients with AI-driven upselling and cross-selling strategies?",
         "Is your team skilled in customizing AI for different retail segments?",
         "What kind of visual recognition AI tools do you offer to retail clients?",
         "How scalable is your AI infrastructure for high-traffic retail seasons?",
         "Do your AI modules offer explainability and transparency to clients?",
         "Are you helping partners comply with AI governance and ethics in retail?",
         "How do you support AI-driven A/B testing for retail campaigns?",
         "Do your AI tools support voice and image-based shopping?",
         "Are you using AI to analyze and optimize the digital shelf experience?",
         "Do you support real-time inventory status updates with AI intelligence?",
         "Are your product recommendation engines continuously learning from client",
         "Is your AI platform secure and GDPR/DPDP compliant?",
         "Do you offer integrations with third-party AI retail tools and CRMs?"
      ],
      "Tier 3":[
         "Have you implemented AI-based recommendation systems on your store?",
         "Do you use AI for customer segmentation and targeting?",
         "Are AI tools used in optimizing product pricing or discounting?",
         "Is inventory forecasting automated using machine learning?",
         "How are AI insights being used in your digital marketing strategy?",
         "Are chatbots or virtual assistants handling customer queries?",
         "Do you use AI to monitor and analyze competitor pricing?",
         "What KPIs are you using to measure AI impact on conversions?",
         "Are you leveraging AI to reduce product return rates?",
         "Is your tech stack ready to support real-time AI decisioning?",
         "How do you ensure ethical use of AI in customer targeting?",
         "Are you using AI to personalize landing pages or home screens?",
         "Do you track shopper behavior to dynamically improve recommendations?",
         "Is AI helping reduce cart abandonment rates?",
         "Are you piloting generative AI for content and ads?",
         "Is AI being used in customer loyalty or rewards programs?",
         "Do you work with consultants or vendors for AI deployment?",
         "Are employees trained to work alongside AI tools?",
         "What data do you collect to train your internal AI systems?",
         "Do you have clear governance for how AI is used in your customer journey?"
      ],
      "Tier 4":[
         "Does your product or platform include AI-powered personalization features?",
         "Are AI-based product recommendations part of your UX?",
         "Do you use AI for demand forecasting or inventory alerts?",
         "Are you integrating third-party AI tools into your commerce platform?",
         "Is AI used in ad performance prediction or content generation?",
         "Do you utilize customer review sentiment analysis?",
         "Are AI insights available on your seller or admin dashboards?",
         "Is AI helping with order fulfillment or delivery tracking?",
         "Are you experimenting with voice commerce or AI chatbots?",
         "How do you collect and clean data for AI use?",
         "Do you use AI to detect fraudulent transactions or suspicious behavior?",
         "Have you tested visual search or product tagging with AI?",
         "Is AI integrated into your email or SMS campaign automation?",
         "Do you have team members dedicated to AI experimentation?",
         "Are you using any no-code AI platforms for development?",
         "Are you exploring generative AI for catalog or banner content?",
         "Do you offer AI features as a service to sellers on your platform?",
         "What cost-saving benefits has AI brought to your ops or marketing?",
         "Are AI metrics integrated into your core KPIs?",
         "How do you explain AI-generated decisions to customers?"
      ],
      "Tier 5":[
         "Are you using AI to optimize your personal e-commerce offerings?",
         "Have you implemented AI-driven recommendation widgets?",
         "Do you experiment with AI-generated product descriptions or copy?",
         "Is AI helping you analyze customer reviews or feedback?",
         "Do you use AI tools for dynamic pricing or promotion?",
         "Are AI chatbots or autoresponders handling initial queries?",
         "Have you tried integrating AI with platforms like Shopify or WooCommerce?",
         "Are you using AI tools to analyze ad campaign effectiveness?",
         "Do you automate email responses with AI text generation?",
         "Is AI helping in visual design or catalog generation?",
         "Do you track customer behavior with AI heatmaps or trackers?",
         "Are you familiar with training small models for product prediction?",
         "Have you explored using AI for logistics tracking or ETA prediction?",
         "Are you measuring conversions influenced by AI recommendations?",
         "Do you conduct A/B tests for AI-driven campaigns?",
         "Are you exploring social listening AI tools for brand feedback?",
         "Do you have a feedback loop for optimizing your AI usage?",
         "Have you built any AI apps for other small retailers?",
         "Are you aware of the ethical implications of AI marketing?",
         "Do you track and improve ROI from AI tools you use?"
      ]
   },
   "Logistics & Supply Chain":{
      "Tier 1":[
         "How is AI used to optimize end-to-end supply chain visibility?",
         "Is AI integrated into your demand planning and forecasting systems?",
         "Are predictive models used for identifying supply chain disruptions?",
         "How is AI enabling dynamic route optimization in real-time?",
         "Do you use AI for real-time warehouse automation and robotics coordination?",
         "Is AI being used to evaluate and rate vendor performance?",
         "How do you ensure traceability and provenance of goods using AI?",
         "Is your transportation management system AI-augmented?",
         "Do you leverage AI for just-in-time (JIT) inventory and replenishment?",
         "How mature is your AI model training pipeline with live operational data?",
         "Are you using AI to model carbon emissions or sustainability impact?",
         "Do your logistics control towers have predictive and prescriptive AI?",
         "How is NLP used for document processing in logistics workflows?",
         "Are anomaly detection models in place for fraud, delays, or theft?",
         "Do you simulate future supply scenarios with AI digital twins?",
         "Are your AI models explainable and regularly audited for bias?",
         "How is generative AI used in supply chain documentation or planning?",
         "Do you integrate AI insights with ERP and CRM systems?",
         "Is AI used to dynamically price logistics services based on demand?",
         "How do you ensure ethical AI use in labor-intensive logistics roles?"
      ],
      "Tier 2":[
         "Does your platform offer predictive AI modules for client logistics?",
         "How is AI helping your clients with warehouse space optimization?",
         "Are you offering customizable AI logistics APIs to partners?",
         "Do you provide AI-powered dashboards for vendor analysis?",
         "Are AI tools used to manage cross-border customs and regulations?",
         "How is AI integrated into multi-modal logistics operations?",
         "Do you offer real-time vehicle tracking and ETA predictions via AI?",
         "Is your platform helping clients minimize logistics costs through AI?",
         "Are you supporting carbon-neutral logistics through AI analytics?",
         "Do you enable automated document processing (BoL, invoices) with AI?",
         "Can your AI models adapt to seasonal fluctuations in shipments?",
         "Do your clients have self-service AI analytics dashboards?",
         "Are AI features packaged as plug-and-play solutions?",
         "Are your AI offerings scalable to meet peak season demands?",
         "How are AI-generated insights made transparent to clients?",
         "Do you provide compliance assistance using AI tools?",
         "Is your platform integrated with major supply chain software (e.g., SAP, Oracle)?",
         "Are you using AI to score logistics risk across regions?",
         "How do you train AI models on anonymized client data?",
         "Do you offer training or workshops to clients for AI integration?"
      ],
      "Tier 3":[
         "Have you implemented AI for route planning or fleet optimization?",
         "Are predictive analytics used in managing inventory levels?",
         "Do you use AI for warehouse layout or staffing optimization?",
         "Is delivery time prediction supported by machine learning?",
         "Are you using AI tools for shipment tracking and updates?",
         "Do AI models help identify potential supply chain bottlenecks?",
         "Is AI assisting in vendor or supplier performance analytics?",
         "Are your logistics costs being benchmarked and reduced via AI?",
         "Do you use AI chatbots or virtual agents for order-related queries?",
         "How often are your AI models retrained with new operational data?",
         "Are your AI outputs integrated into dashboards or ERP tools?",
         "Have you deployed AI for demand forecasting in sourcing decisions?",
         "Are visual inspection tools used in packaging and QC processes?",
         "Is AI used in procurement analytics or tendering?",
         "Do you track and visualize logistics KPIs via AI-enhanced systems?",
         "Are customer complaints or feedback fed into AI learning loops?",
         "Is your team equipped with basic AI literacy and tools?",
         "Do you work with external partners for AI-driven logistics?",
         "Are generative AI tools used to generate shipment summaries?",
         "Are your systems able to handle data streams required for real-time AI?"
      ],
      "Tier 4":[
         "Are you using AI tools for last-mile delivery optimization?",
         "Have you integrated third-party AI APIs into your logistics stack?",
         "Is AI being used to predict inventory stock-outs?",
         "Do you use AI to alert on shipment delays or route issues?",
         "Are vehicle tracking systems powered by AI-based analytics?",
         "Do you use AI tools for fuel optimization and trip planning?",
         "Is AI helping you with order fulfillment timing and accuracy?",
         "Are visual or barcode scanning tools AI-enhanced?",
         "Is warehouse staffing or scheduling optimized via AI tools?",
         "Are you using AI to assist in RFPs or vendor selection?",
         "Do you monitor customer satisfaction using AI sentiment tools?",
         "Are AI features part of your digital logistics dashboard?",
         "Are you using AI to monitor shipment integrity (e.g., temp sensors)?",
         "Is your operations team trained to interpret AI-generated insights?",
         "Do you use low-code/no-code AI tools to solve logistics issues?",
         "Are AI tools helping manage delivery partner performance?",
         "Have you tried AI-assisted route simulations for cost savings?",
         "Are package delay reasons classified by AI?",
         "Are AI tools being explored to automate manual entry or documentation?",
         "Do you offer AI-powered tools as a value add to your logistics clients?"
      ],
      "Tier 5":[
         "Do you use AI tools to plan logistics or delivery schedules?",
         "Are you tracking delivery KPIs using AI dashboards?",
         "Have you implemented AI for basic route optimization?",
         "Are you experimenting with AI for shipment delay predictions?",
         "Do you use AI to analyze transportation costs?",
         "Is AI helping manage inventory on a small scale?",
         "Are you using chatbots or assistants to manage order logistics?",
         "Have you explored AI to classify and tag logistics data?",
         "Are you using AI to generate customer notifications for delivery?",
         "Do you use OCR-based AI tools to scan bills or invoices?",
         "Are you using any open-source AI logistics tools?",
         "Is AI helping you streamline supplier communication?",
         "Are you tracking fuel usage with AI-based suggestions?",
         "Have you created any basic machine learning models using your own logistics",
         "Are you leveraging any AI-based forecasting spreadsheets?",
         "Have you tested AI for warehouse layout suggestions?",
         "Are you using AI to generate reports for clients?",
         "Is data from GPS, sensors, or RFID being used for basic AI modeling?",
         "Are AI models being tested to recommend shipping partners?",
         "Have you used AI to understand where delays happen in your process?"
      ]
   },
   "Agritech":{
      "Tier 1":[
         "Is AI used for crop yield prediction at a national or multi-regional scale?",
         "Are satellite and drone data integrated into AI-powered crop health models?",
         "Is AI used for precision agriculture to optimize irrigation and pesticide usage?",
         "Do you use AI to drive decisions on seed selection based on geospatial data?",
         "Are your AI models continuously trained with real-time sensor and weather",
         "Is AI being used to optimize the global agri-supply chain in real time?",
         "Are you using generative AI to simulate climate-based crop outcome scenarios?",
         "Is AI deployed to detect and predict disease outbreaks across multiple zones?",
         "Are you integrating AI with IoT for real-time monitoring of soil and crop?",
         "Do you use AI to design and optimize agro-machinery or robotics systems?",
         "Are autonomous farming vehicles and drones guided by AI?",
         "Is your AI strategy aligned with global sustainability and carbon goals?",
         "Are AI models supporting decisions for agricultural investments and risk?",
         "Do you use AI to model and mitigate risks in contract farming operations?",
         "Is your pricing and procurement strategy AI-driven?",
         "Are NLP models used to translate insights for farmers in regional languages?",
         "Do you use computer vision models to grade produce quality?",
         "How is AI used for warehouse planning and post-harvest logistics?",
         "Are predictive analytics used for market demand forecasting?",
         "Are your AI efforts audited for ethical implications in rural tech adoption?"
      ],
      "Tier 2":[
         "Are your products offering AI-based weather advisory services?",
         "Do you offer AI-powered dashboards to large farm clients and cooperatives?",
         "Are you providing drone-as-a-service with AI image recognition?",
         "Do you support farmers with AI tools for soil health analysis?",
         "Is your advisory platform integrated with AI crop disease diagnostics?",
         "Are you offering AI-driven crop lifecycle or fertilizer planning tools?",
         "Is your logistics platform for agri-goods AI optimized?",
         "Are your solutions integrated with third-party agronomy AI services?",
         "Is your AI system adaptive to local geography and micro-climates?",
         "Do you offer APIs for clients to access your AI crop intelligence systems?",
         "Is your AI-based pest control recommendation engine scalable?",
         "Do you support clients in carbon credit modeling using AI?",
         "Are your agritech solutions cross-compatible with satellite and drone vendors?",
         "Do your AI solutions work offline or in low-bandwidth regions?",
         "Are you helping stakeholders measure ROI on AI-based decisions?",
         "Are AI outputs being shared in local dialects using voice assistants?",
         "Do you partner with universities to test or refine your AI models?",
         "Is your client onboarding process AI-driven or AI-supported?",
         "Do your insights help optimize cold chain infrastructure planning?",
         "Do you publish AI-related performance metrics on your agritech tools?"
      ],
      "Tier 3":[
         "Are you using AI tools for crop and soil analysis in small clusters?",
         "Do you predict market demand or price trends using AI models?",
         "Is your irrigation scheduling assisted by AI weather models?",
         "Do you use AI to suggest the best sowing and harvesting times?",
         "Have you used AI for anomaly detection in yield or production cycles?",
         "Are AI-powered tools used in evaluating farm inputs like seeds or fertilizers?",
         "Do you leverage AI-based advisory to reduce input costs?",
         "Are you using AI chatbots for farmer support and queries?",
         "Is AI helping you segment customer data for targeted advisories?",
         "Are you tracking pest infestations using computer vision tools?",
         "Are you testing AI for livestock health or breeding optimization?",
         "Are you using satellite or drone data for localized AI predictions?",
         "Do your farmers receive alerts or advisories via AI-based systems?",
         "Do you provide AI training or interpretation services to partner farmers?",
         "Are AI tools helping you reduce wastage or optimize packaging?",
         "Do you use AI for digital marketplaces or farmer price optimization?",
         "Are crop loss predictions or insurance claims AI-augmented?",
         "Do you integrate with banks or NBFCs using AI for loan risk assessment?",
         "Are AI insights available in multilingual formats?",
         "Do you measure how your AI features impact farm productivity?"
      ],
      "Tier 4":[
         "Have you deployed AI to recommend fertilizers based on crop stage?",
         "Are you using ML models to alert about local weather risks?",
         "Do your tools suggest planting patterns based on historical data?",
         "Are AI tools used for early-stage disease detection?",
         "Is your startup testing AI in greenhouses or controlled environments?",
         "Do you use AI to classify soil types from camera inputs?",
         "Are you using AI to estimate market demand for specific crops?",
         "Are farmers receiving real-time recommendations via WhatsApp/chat?",
         "Are your AI models trained with region-specific datasets?",
         "Do you use AI to reduce pesticide use and improve eco-practices?",
         "Are you helping farmers access financial services using AI credit scoring?",
         "Do you use AI tools to manage digital farm records?",
         "Is your post-harvest planning supported by AI analytics?",
         "Have you explored low-cost AI solutions for water usage efficiency?",
         "Do you enable AI access via mobile-friendly dashboards?",
         "Are AI models used in your farmer education or training modules?",
         "Have you built any AI recommendation systems for agro-markets?",
         "Are government subsidy schemes integrated into your AI model logic?",
         "Are your AI recommendations cross-checked by domain experts?",
         "Are your apps optimized for voice-based AI interaction?"
      ],
      "Tier 5":[
         "Are you using AI tools to assist local farmers with crop planning?",
         "Have you explored open-source models for plant disease detection?",
         "Are you experimenting with drone imagery for AI classification?",
         "Do you use any AI-based pricing or weather forecasting tools?",
         "Have you trained AI models on small farming datasets?",
         "Are you using spreadsheets enhanced by AI predictions for agri-analysis?",
         "Do you analyze remote sensing data using simple ML models?",
         "Are you developing mobile apps with AI support for rural usage?",
         "Do you use translation tools to make AI insights more accessible?",
         "Are you customizing pre-trained models for your own farm data?",
         "Have you built any yield prediction tools using Python or R?",
         "Are you working with cooperatives to deploy low-cost AI models?",
         "Do you use AI to support agri-consulting or advisory services?",
         "Are you exploring audio-based AI interfaces for low-literacy farmers?",
         "Do you use sentiment analysis to gauge farmer satisfaction?",
         "Have you created any simple computer vision tools for pests or soil?",
         "Do you share your AI findings in farmer training sessions?",
         "Are you applying AI for greenhouse data interpretation?",
         "Are you publishing blogs or tutorials on AI in agriculture?",
         "Do you mentor others in rural areas to adopt AI techniques?"
      ]
   },
   "IT & ITES (Information Technology & IT-Enabled Services)":{
      "Tier 1":[
         "Do you have a company-wide AI adoption roadmap aligned with business goals?",
         "Are all major IT functions (e.g., support, infrastructure, development) integrated",
         "Have you deployed enterprise-level AI platforms (e.g., Azure ML, Vertex AI,",
         "Are AI models automatically retrained using continuous data streams?",
         "Do you use AI for advanced cybersecurity threat detection and mitigation?",
         "Are customer service and IT helpdesk functions AI-enabled at scale?",
         "Do your software delivery pipelines leverage AI for test automation and defect",
         "Is AI used for large-scale data quality management and cleansing?",
         "Are AI-driven business insights embedded in your dashboards and BI tools?",
         "Do you use AI to manage SLA adherence and process optimization in service",
         "Are AI-based decision systems used in strategic IT investments?",
         "Is your RPA (Robotic Process Automation) integrated with machine learning",
         "Do you use AI for large-scale IT asset management and optimization?",
         "Are NLP tools used across languages for documentation and knowledge base",
         "Do you conduct regular audits of AI model performance and bias?",
         "Are AI models supporting real-time anomaly detection in network operations?",
         "Do you develop custom AI tools for client-specific IT/ITES use cases?",
         "Is your company involved in open-source contributions or research in AI?",
         "Is there a C-level executive or board committee overseeing AI strategy?",
         "Do your AI systems meet international standards for ethical AI practices?"
      ],
      "Tier 2":[
         "Do you offer AI-powered IT services (e.g., intelligent service desk, AIOps)?",
         "Are you enabling clients to migrate legacy systems using AI assistance?",
         "Do you build AI accelerators or reusable models for client projects?",
         "Is AI used in optimizing project timelines, budgets, or resources?",
         "Do you help clients automate workflows through AI-integrated tools?",
         "Do you develop AI-powered chatbots for enterprise clients?",
         "Are your teams trained in scalable deployment of ML pipelines for clients?",
         "Do your SLAs reflect the value added by AI in service delivery?",
         "Is AI used in quality assurance or UAT cycles for client software?",
         "Are AI models optimized for multi-region compliance (e.g., GDPR, HIPAA)?",
         "Do you customize LLMs (Large Language Models) for client-specific needs?",
         "Are you embedding AI into ITSM tools like ServiceNow, Jira, etc.?",
         "Do your teams provide AI-readiness assessments to new clients?",
         "Is AI helping you identify upsell or cross-sell opportunities within IT clients?",
         "Do your systems enable client self-service via AI assistants?",
         "Are you exploring generative AI for code refactoring or migration?",
         "Is your documentation process enhanced by AI summarization tools?",
         "Do you offer clients AI dashboards with transparency on usage and ROI?",
         "Are AI integrations audited regularly for performance and risks?",
         "Is there an internal feedback loop to enhance AI offerings based on client usage?"
      ],
      "Tier 3":[
         "Do you use AI tools for ticket routing or issue triaging in support operations?",
         "Are you integrating LLMs to improve software documentation or coding",
         "Have you implemented AI chatbots for client support or internal helpdesk?",
         "Are ML models assisting in client risk analysis or upselling decisions?",
         "Are you using AI to optimize internal processes like HR, payroll, or finance?",
         "Is AI used to detect anomalies in system logs or infrastructure metrics?",
         "Are AI-based dashboards helping you understand project health?",
         "Have you piloted AI in test case generation or regression testing?",
         "Is AI applied in improving client onboarding and KYC processes?",
         "Are you using pre-trained AI tools to automate manual workflows?",
         "Is AI aiding in security incident response or phishing detection?",
         "Are you exploring AI-based transcription for meeting summaries?",
         "Have you adopted AI in recruitment (e.g., resume screening)?",
         "Is RPA supported by AI to perform intelligent decision-making?",
         "Do you use sentiment analysis to track customer experience?",
         "Are you using open-source AI libraries like HuggingFace or spaCy?",
         "Is there an AI center of excellence or innovation cell in your organization?",
         "Are teams encouraged to create AI-driven PoCs for clients?",
         "Are your internal processes mapped for AI automation potential?",
         "Do you offer value-added AI insights to enhance client delivery?"
      ],
      "Tier 4":[
         "Do you use GPT-based models for code generation or tech support?",
         "Are AI tools helping automate software QA or bug tracking?",
         "Have you built internal tools using AI for workload or project planning?",
         "Do you use AI in cold outreach, email optimization, or customer profiling?",
         "Are you testing AI models for log monitoring and alert prioritization?",
         "Have you adopted voice or chat-based AI for client onboarding?",
         "Are you integrating AI for IT documentation and troubleshooting guides?",
         "Do you apply AI to optimize cloud resource usage or costs?",
         "Are you using AI tools to generate or summarize tech proposals?",
         "Is AI helping with competitive intelligence or client data mining?",
         "Are you deploying low-code/no-code AI solutions?",
         "Do you use open-source AI platforms to prototype new products?",
         "Have you implemented RAG (Retrieval Augmented Generation) for internal KBs?",
         "Is AI helping identify patterns in client escalations or churn?",
         "Do you use AI-enhanced tools like Copilot or Tabnine for dev workflows?",
         "Are you testing generative AI for synthetic data generation?",
         "Is customer feedback looped into AI systems for enhancement?",
         "Do you document and track AI model results internally?",
         "Are you participating in AI hackathons or accelerators?",
         "Do you provide AI-powered value-added services to smaller IT clients?"
      ],
      "Tier 5":[
         "Do you use AI tools like GitHub Copilot for software development?",
         "Have you built or deployed AI chatbots for clients or your own site?",
         "Are you using pre-trained models for classification, NLP, or summarization?",
         "Have you fine-tuned open-source LLMs for niche IT solutions?",
         "Are you offering AI automation consulting for small businesses?",
         "Do you integrate AI APIs (e.g., OpenAI, HuggingFace) in client work?",
         "Are you building portfolio projects that include AI use cases?",
         "Have you created AI-enhanced tools or browser extensions?",
         "Do you actively track AI trends and apply them in your work?",
         "Are you experimenting with AI for personal productivity (e.g., Notion AI)?",
         "Have you built AI-driven analytics dashboards for clients?",
         "Are you exploring custom GPTs for client-specific knowledge tasks?",
         "Have you tried AI for marketing automation or SEO analysis?",
         "Do you use AI for data visualization or storytelling?",
         "Are you integrating AI with mobile or web app builds?",
         "Do you use AI to scrape, clean, and analyze public datasets?",
         "Have you built a productized service using AI?",
         "Do you teach or mentor others on AI implementation?",
         "Do you measure and report AI model performance in client projects?",
         "Are you building multi-modal apps (text, image, voice) powered by AI?"
      ]
   },
   "Legal & Compliance":{
      "Tier 1":[
         "Do you have an enterprise-wide AI governance and compliance framework?",
         "Are AI tools used for real-time contract review and risk flagging?",
         "Have you deployed AI to ensure compliance with global regulations (e.g., GDPR,",
         "Do you use AI to monitor and audit employee compliance in real-time?",
         "Are LLMs fine-tuned to review legal documents across multiple jurisdictions?",
         "Is AI integrated into enterprise legal management systems (ELMS)?",
         "Are AI models used to predict legal risks or litigation outcomes?",
         "Is AI applied to manage intellectual property, trademark, or patent portfolios?",
         "Do compliance reports include AI-generated insights or anomalies?",
         "Are ethical AI guidelines enforced through internal legal protocols?",
         "Do you utilize AI for ongoing regulatory change management?",
         "Are AI tools integrated into whistleblower or incident reporting systems?",
         "Is there a regular audit of AI tools used for bias, legality, and fairness?",
         "Are NLP tools used for large-scale document summarization and case law",
         "Do you use AI to automate due diligence during mergers or acquisitions?",
         "Are predictive analytics used for compliance breach detection?",
         "Are compliance teams equipped with real-time AI dashboards?",
         "Do you co-develop legal AI solutions with external providers?",
         "Is AI used to redact or anonymize sensitive documents securely?",
         "Do you maintain a compliance audit trail for all AI-based decisions?"
      ],
      "Tier 2":[
         "Do your services include AI-powered legal research or contract automation?",
         "Are you providing regulatory AI tools to help clients manage compliance?",
         "Do you offer AI-enabled document review platforms to law firms or enterprises?",
         "Is your AI solution tailored for industry-specific compliance (e.g., BFSI, Pharma)?",
         "Are you integrating AI with existing client tools like DMS or ERP?",
         "Are compliance checklists automatically populated using AI from regulatory",
         "Do your AI tools support multi-language legal document translation and review?",
         "Are your systems capable of bulk review and tagging of legal documents via AI?",
         "Are you helping clients track litigation risks using predictive models?",
         "Is your AI able to detect discrepancies or fraudulent entries in regulatory filings?",
         "Are chatbots used to answer internal compliance queries?",
         "Do you deliver AI-as-a-service tools for digital legal transformation?",
         "Are AI-based tools deployed to manage e-discovery and digital forensics?",
         "Are you offering AI-powered IP or patent watch services?",
         "Do you perform validation and bias testing on legal AI outputs?",
         "Are you actively involved in shaping legal tech compliance standards?",
         "Are AI solutions audited to ensure data protection and ethical AI usage?",
         "Do you support versioning and history tracking of legal advice delivered via AI?",
         "Are your teams trained in the legal implications of AI use?",
         "Are client-facing AI products tailored per region or sector-specific laws?"
      ],
      "Tier 3":[
         "Have you adopted AI to automate NDA and contract generation?",
         "Is AI used to flag potential non-compliance issues in internal audits?",
         "Do you use AI tools to analyze policy violations or incident reports?",
         "Are ML tools helping you monitor compliance KPIs?",
         "Are you using LLMs to extract clauses from contracts or legal databases?",
         "Do AI tools help with internal case law research or precedent discovery?",
         "Are AI-generated summaries reviewed by legal experts before finalization?",
         "Is AI used to manage compliance checklists or internal policy updates?",
         "Are compliance officers using AI to assess vendor or partner risks?",
         "Are regulatory changes tracked using AI monitoring systems?",
         "Is redlining or document markup assisted by AI tools?",
         "Are you deploying AI for internal policy mapping to regulations?",
         "Do you use AI for identifying outdated or conflicting clauses in contracts?",
         "Are bots integrated for answering common HR or compliance questions?",
         "Are client deliverables enhanced with AI-generated risk insights?",
         "Do you validate AI model outputs with real-world compliance data?",
         "Are document review workflows optimized using AI queueing?",
         "Is AI part of training programs on ethics and compliance?",
         "Are you using AI to manage whistleblower reports or feedback?",
         "Are internal compliance reports generated via AI dashboards?"
      ],
      "Tier 4":[
         "Have you deployed AI bots to assist with contract creation or clause",
         "Do you use AI tools like DocuSign AI or LawGeex for small-scale reviews?",
         "Are AI tools used for GDPR audit checklists or risk scanning?",
         "Is NLP helping you extract key terms from templates or legal notes?",
         "Are you integrating AI APIs to validate regulatory clauses in documents?",
         "Have you explored GPT-based tools to generate legal drafts?",
         "Is your legal compliance documentation supported by AI?",
         "Are startups using AI to automate e-discovery for litigation support?",
         "Is risk scoring for clients or documents done with AI?",
         "Are you leveraging RPA + AI to check policy compliance automatically?",
         "Is your legal documentation enhanced with AI summaries or suggestions?",
         "Are you using AI to translate legal documents across languages?",
         "Are tools like Clausehound or Ironclad part of your tech stack?",
         "Are dashboards used to track AI-inferred compliance trends?",
         "Are AI-based keyword detection tools used in forensic analysis?",
         "Do you use chatbots to guide employees on legal processes?",
         "Is AI deployed to reduce human workload in regulatory filing prep?",
         "Do you use semantic search for case law within your firm?",
         "Are you building client-facing apps powered by legal AI?",
         "Are your AI tools benchmarked with legal accuracy standards?"
      ],
      "Tier 5":[
         "Are you using ChatGPT or Claude for legal note-taking or clause drafting?",
         "Have you built or used an AI-powered contract review tool?",
         "Do you automate standard agreements using AI templates?",
         "Are you offering AI readiness consulting to small law firms?",
         "Have you fine-tuned an LLM with legal datasets for personal projects?",
         "Are you actively using legal AI tools like Harvey, Lexis+ AI, or CoCounsel?",
         "Are you leveraging NLP for case law discovery and summarization?",
         "Have you used AI to benchmark or validate legal advice?",
         "Are you building smart contracts or legal dApps using AI guidance?",
         "Do you use AI to detect risks in client policy documentation?",
         "Are you part of communities exploring AI in legal practice?",
         "Have you tested GPT models for legal opinion drafting?",
         "Do you offer services that include AI-based risk analysis?",
         "Are you creating or maintaining a personal legal knowledge base with AI?",
         "Are you enhancing due diligence using AI data gathering?",
         "Are AI-generated insights peer-reviewed before client submission?",
         "Have you tried auto-tagging legal documents using AI?",
         "Are you combining AI with document automation tools like Docassemble?",
         "Do you write blog posts or newsletters using AI assistance?",
         "Have you taken courses or certifications in legal tech or AI law?"
      ]
   },
   "Energy & Utilities":{
      "Tier 1":[
         "Have you implemented AI-based grid optimization systems at scale?",
         "Is predictive maintenance using AI applied across your energy infrastructure?",
         "Are AI algorithms being used for dynamic demand forecasting and load",
         "Do you use AI to detect energy theft or abnormal consumption patterns?",
         "Are AI-enabled smart meters integrated with your customer experience",
         "Do your AI systems incorporate climate models to predict supply variability?",
         "Is AI used to manage the integration of renewables into the energy mix?",
         "Are your AI models trained with real-time data from IoT and SCADA systems?",
         "Do you have an enterprise-wide AI strategy to reduce carbon emissions?",
         "Is AI used for automated fault detection in pipelines, grids, or power stations?",
         "Are you leveraging AI to manage and optimize energy trading?",
         "Do your AI systems support autonomous energy distribution decisions?",
         "Is AI used in your strategic planning to forecast long-term energy needs?",
         "Are advanced ML models used for predictive asset lifecycle management?",
         "Do you use AI-powered chatbots for billing, complaints, and outage reporting?",
         "Are you monitoring and mitigating AI risks related to critical infrastructure?",
         "Is ROI from AI investments in your energy infrastructure being tracked?",
         "Are LLMs used to process legal and regulatory compliance documents?",
         "Are your AI models tested against extreme weather or blackout scenarios?",
         "Are AI dashboards used by C-suite leaders for real-time operational insights?"
      ],
      "Tier 2":[
         "Are you providing AI-based energy analytics solutions to clients?",
         "Do your tools support AI-driven predictive maintenance and monitoring?",
         "Are AI algorithms used to manage distributed energy resources (DERs)?",
         "Do you offer AI modules that optimize grid reliability for clients?",
         "Are AI-enabled simulations part of your digital twin offerings?",
         "Do your AI services comply with safety and utility-specific regulations?",
         "Are smart meter data analyzed using AI to deliver real-time insights?",
         "Do your solutions support AI-led outage prediction and mitigation?",
         "Are AI-driven tools integrated into your energy management platforms?",
         "Do your AI models assess the impact of policy changes on energy systems?",
         "Are AI algorithms used for forecasting solar and wind power output?",
         "Is AI applied in the management of hydrogen, geothermal, or nuclear energy?",
         "Are you using NLP to help energy clients automate reporting and",
         "Do you help clients use AI to optimize energy storage systems?",
         "Do you offer AI-powered dashboards for utility command centers?",
         "Are your AI solutions benchmarked with energy industry KPIs?",
         "Do you track carbon footprint reductions from AI implementations?",
         "Are your AI tools built with cybersecurity safeguards in critical infrastructure?",
         "Do your AI services support remote diagnostics and asset control?",
         "Are you offering tailored AI solutions for power, gas, and water utilities?"
      ],
      "Tier 3":[
         "Have you begun implementing AI for smart grid or microgrid monitoring?",
         "Are AI tools used to manage your energy distribution losses?",
         "Do you use AI for load forecasting at a regional or city level?",
         "Are maintenance schedules generated using AI-based condition monitoring?",
         "Do your customer service teams use AI chatbots or virtual agents?",
         "Are smart sensor data being utilized for AI-based anomaly detection?",
         "Is AI helping you evaluate and reduce operational inefficiencies?",
         "Do you use AI to monitor emissions and ensure compliance?",
         "Are you experimenting with AI for dynamic pricing or tariff optimization?",
         "Is AI being tested for predictive outage and downtime alerts?",
         "Are your teams trained to use AI tools for daily reporting and analytics?",
         "Are you using AI to support decisions in grid expansion or upgrades?",
         "Are energy thefts flagged using pattern recognition models?",
         "Do you use AI to model customer consumption behaviors?",
         "Are you integrating AI into existing energy ERP or SCADA systems?",
         "Do you use AI-generated reports in investor or regulatory presentations?",
         "Are you using cloud-based AI platforms to avoid infrastructure costs?",
         "Do you track savings or efficiencies created via AI implementation?",
         "Have you piloted AI for energy-efficient facility management?",
         "Are AI-based tools used in vendor and supply chain risk evaluation?"
      ],
      "Tier 4":[
         "Have you launched AI-driven tools for renewable energy forecasting?",
         "Is AI used to optimize energy generation from solar panels or wind turbines?",
         "Are smart plug or appliance data being used to train AI consumption models?",
         "Are you building AI-based platforms for household or commercial energy",
         "Do you offer energy-as-a-service models supported by AI automation?",
         "Are you combining AI with IoT to offer real-time consumption insights?",
         "Are virtual energy assistants/chatbots used for customer interaction?",
         "Is AI used to automate regulatory compliance in your energy systems?",
         "Are AI models helping you benchmark facility energy performance?",
         "Do you use AI to suggest efficiency improvements to clients?",
         "Are smart building systems supported by AI for HVAC control?",
         "Have you partnered with utilities to provide AI-based energy analytics?",
         "Are AI tools used for startup-level predictive load balancing?",
         "Do you offer dashboards or reports using AI-generated insights?",
         "Are you using cloud-based AI services like AWS SageMaker or Azure ML?",
         "Are AI models part of your pitch to investors or accelerators?",
         "Have you created any custom datasets to train AI for local energy needs?",
         "Are you experimenting with generative AI for report or strategy creation?",
         "Is AI used in your customer onboarding or billing systems?",
         "Do your AI solutions help clients estimate ROI for green initiatives?"
      ],
      "Tier 5":[
         "Are you consulting firms on AI implementation in energy and utilities?",
         "Have you developed or used AI tools for demand-side energy optimization?",
         "Are you building LLMs or ML models for sustainability reporting?",
         "Do you use open-source tools like PyGrid or GridLAB-D for AI modeling?",
         "Are you working with clients to implement smart energy dashboards?",
         "Do you use AI to assess emissions from industrial energy systems?",
         "Are you publishing blogs, case studies, or white papers on AI in energy?",
         "Do you offer AI-powered audits for energy management systems?",
         "Are you training AI models on public utility or energy consumption datasets?",
         "Are you involved in AI research for renewable energy transition?",
         "Have you integrated AI tools with open energy data platforms?",
         "Do you use predictive ML models for optimizing battery storage?",
         "Are you prototyping AI solutions for solar or wind plant design?",
         "Do you evaluate energy suppliers or partners using AI benchmarks?",
         "Are you building datasets to support regional grid intelligence?",
         "Do you use AI to analyze ESG and green compliance scores?",
         "Are you contributing to open-source AI energy tech repositories?",
         "Do you help NGOs or public utilities with AI adoption strategies?",
         "Are you working on AI for electric vehicle charging station optimization?",
         "Do you use AI to help clients monitor energy usage anomalies?"
      ]
   },
   "Telecommunications":{
      "Tier 1":[
         "Are AI models integrated across your telecom network for real-time",
         "Do you use AI for predictive maintenance of network hardware and",
         "Are AI-driven systems used to dynamically manage network congestion and",
         "Is customer churn predicted and mitigated using AI-based behavioral analysis?",
         "Are AI-powered virtual agents deployed at scale for customer service?",
         "Is AI used to monitor and reduce fraud in telecom services and billing?",
         "Do AI models predict usage patterns for 5G or IoT service planning?",
         "Are AI tools used in optimizing and deploying network towers or edge nodes?",
         "Is AI leveraged in strategic CAPEX planning for network expansion?",
         "Are anomaly detection models deployed for cyber threat identification?",
         "Is NLP used for customer sentiment analysis across calls, emails, and chats?",
         "Do AI systems integrate billing data, customer usage, and CRM for 360°",
         "Are AI/ML models used in automated QoS (Quality of Service) management?",
         "Is AI implemented for intelligent routing and traffic prioritization?",
         "Are AI analytics dashboards used by leadership for real-time business visibility?",
         "Are LLMs used internally to summarize policies or compliance updates?",
         "Are you tracking AI ROI across different operational and marketing units?",
         "Is AI used to identify cross-sell and upsell opportunities automatically?",
         "Are AI-enabled bots used for network performance diagnostics by customers?",
         "Do you have a centralized AI governance framework across departments?"
      ],
      "Tier 2":[
         "Do your products include AI modules for network monitoring and optimization?",
         "Are you providing telecom companies with AI-powered customer analytics",
         "Is predictive AI used in your hardware lifecycle management systems?",
         "Are AI chatbots or IVR tools part of your telecom service suite?",
         "Do your AI solutions integrate with OSS/BSS platforms?",
         "Are fraud detection and spam filtering models part of your offerings?",
         "Do your tools support AI-led planning for tower locations or spectrum",
         "Are anomaly detection models embedded in your cybersecurity solutions?",
         "Do your AI tools assist in 5G rollout strategy and load simulations?",
         "Are you using AI to optimize energy consumption across telecom hardware?",
         "Are personalized marketing and AI segmentation part of your client services?",
         "Do you use NLP to extract insights from call logs or complaints?",
         "Is customer retention analytics powered by AI in your product line?",
         "Are LLMs used in your internal knowledge management systems?",
         "Are your AI tools modular and customizable for telecom clients?",
         "Do you provide AI usage reports or dashboards to clients?",
         "Is your AI development aligned with telecom-specific regulations?",
         "Are generative AI tools used for network design or technical documentation?",
         "Are your AI services benchmarked against SLA/KPI standards in telecom?",
         "Are you integrating federated learning for secure telecom data applications?"
      ],
      "Tier 3":[
         "Have you started using AI to analyze customer churn or satisfaction?",
         "Are AI chatbots or voice bots deployed for Tier 1 support queries?",
         "Do you use AI to monitor your telecom infrastructure for outages?",
         "Are ML models used to predict data traffic or plan network expansion?",
         "Is AI used to reduce call drops or improve voice quality?",
         "Are analytics dashboards supported by AI-generated recommendations?",
         "Do you use AI to identify peak usage hours for targeted offerings?",
         "Are AI tools being considered for fraud detection and usage anomalies?",
         "Is AI used to help forecast revenue or service plan popularity?",
         "Do you use AI to identify poor coverage areas and suggest improvements?",
         "Are customer sentiment insights extracted from service feedback using NLP?",
         "Is your team trained to operate and troubleshoot AI-based systems?",
         "Are you experimenting with AI-powered predictive capacity planning?",
         "Do you use AI to help personalize marketing campaigns or promos?",
         "Is AI being tested for complaint classification and routing?",
         "Are your systems integrated with cloud-based AI platforms like AWS or Azure?",
         "Do you track performance improvements after AI implementation?",
         "Have you deployed AI for regulatory compliance monitoring?",
         "Are AI insights shared with product and sales teams for planning?",
         "Do you use AI to optimize or automate billing and invoicing?"
      ],
      "Tier 4":[
         "Are you developing AI-driven mobile apps for customer support or self-service?",
         "Are AI chatbots used to onboard customers or explain plan options?",
         "Are usage data analyzed to provide personalized telecom offers using AI?",
         "Do you use AI for pricing optimization and competitive analysis?",
         "Are you integrating AI with VoIP or OTT calling apps?",
         "Are AI models used for rapid fraud or spam number detection?",
         "Are AI dashboards used for startup performance tracking?",
         "Is NLP used to automatically respond to customer tickets or FAQs?",
         "Are you using AI to optimize bandwidth in real-time for your offerings?",
         "Are you building AI tools for quick diagnostics of SIM/network issues?",
         "Do you leverage AI to handle porting requests or network switch validations?",
         "Is customer LTV prediction modeled using AI-based segmentation?",
         "Are AI-generated reports used for pitch decks or investor presentations?",
         "Are you testing AI-generated call scripts or marketing emails?",
         "Are generative AI tools being used for ad copy or customer documentation?",
         "Do your tools use AI to detect and block SIM box fraud or fake accounts?",
         "Are your systems API-compatible with telecom AI ecosystems?",
         "Are you building an internal knowledge base using AI?",
         "Are you developing AI solutions that are cloud-native and telecom-ready?",
         "Are you tracking performance of AI-based experiments in your platform?"
      ],
      "Tier 5":[
         "Are you building AI tools for telecom network diagnostics or optimization?",
         "Do you offer consultancy on implementing AI in telecom business models?",
         "Are you training AI models on call center or customer complaint datasets?",
         "Have you built chatbots or NLP models for telecom customer engagement?",
         "Are you contributing to open-source telecom AI repositories?",
         "Are you creating models to detect telecom fraud or spam call patterns?",
         "Do you write or publish about AI's use in 5G and telecom systems?",
         "Are you building AI tools for spectrum allocation simulation?",
         "Do you prototype AI tools for predictive QoS improvement?",
         "Are you involved in benchmarking AI tools against telecom KPIs?",
         "Have you developed AI solutions for IVR analytics or speech-to-text?",
         "Are you training LLMs to handle telecom-specific workflows or compliance?",
         "Are you creating visualizations powered by AI for telecom reports?",
         "Are you building telecom-focused datasets for AI training?",
         "Do you assist clients in building secure AI solutions for customer data?",
         "Are you experimenting with zero-shot AI models for telecom queries?",
         "Do you provide documentation, user guides, or dashboards powered by AI?",
         "Have you built real-time anomaly detection systems for telecom traffic?",
         "Are you consulting small ISPs or telcos on AI readiness?",
         "Are you exploring federated learning or privacy-preserving AI in telecom?"
      ]
   },
   "Media & Entertainment":{
      "Tier 1":[
         "Are AI models used for personalized content recommendations at scale?",
         "Do you use AI to predict viewership trends and optimize content strategy?",
         "Are generative AI tools used to create synthetic content (e.g., scripts, visuals)?",
         "Do you use AI to dynamically personalize UI/UX for viewers?",
         "Are AI tools used to automate and optimize ad placement and targeting?",
         "Is AI leveraged for intelligent content indexing, tagging, and search?",
         "Are real-time AI analytics used to drive decisions on programming schedules?",
         "Do you use AI to localize and dub content in multiple languages?",
         "Are AI models deployed for detecting and filtering inappropriate content?",
         "Are predictive models used to identify potential blockbuster content?",
         "Is AI used to track audience sentiment and social media feedback?",
         "Are AI tools integrated into your creative production pipelines?",
         "Do you use AI to optimize licensing and rights management?",
         "Are LLMs used for script generation, synopsis creation, and storyboarding?",
         "Is AI used to generate personalized content previews or trailers?",
         "Are AI-enhanced voiceovers or avatars used in your production?",
         "Is content performance monitored using AI-enhanced KPIs?",
         "Are AI systems integrated across OTT, broadcast, and digital arms?",
         "Are deep learning models used to optimize compression and streaming quality?",
         "Is your AI strategy governed by a dedicated AI leadership or council?"
      ],
      "Tier 2":[
         "Are AI tools embedded into your video or image post-production workflows?",
         "Do you offer AI-based content tagging or archiving services to clients?",
         "Are generative AI tools used in your creative brainstorming or concepting?",
         "Do you provide predictive content performance analytics?",
         "Are AI models used to detect plagiarism or copyright violations?",
         "Are AI tools used to generate dynamic social media or marketing creatives?",
         "Do you use AI to automate subtitling and closed caption generation?",
         "Are LLMs used to assist with writing briefs, ads, or creative content?",
         "Do you use AI to enhance content for accessibility (e.g., audio description)?",
         "Are AI systems used for metadata generation in media asset management?",
         "Are client dashboards AI-powered for real-time performance tracking?",
         "Are you using AI to create hyper-targeted campaign variations?",
         "Are your editors using AI tools for image enhancement or style transfer?",
         "Is AI used to manage and optimize multi-platform content delivery?",
         "Are you using AI for customer journey mapping across content channels?",
         "Do your AI tools integrate with major platforms like Adobe, Final Cut, etc.?",
         "Are AI-generated storyboards or concept art part of your workflow?",
         "Do you use AI to analyze pitch success rates or production ROI?",
         "Is client feedback processed via NLP tools for insights?",
         "Do you provide clients with AI-readiness assessment or training?"
      ],
      "Tier 3":[
         "Do you use AI for basic content recommendation or personalization?",
         "Are AI-based editing tools used for noise removal or color correction?",
         "Do you use AI to monitor content performance on YouTube or OTT?",
         "Are you using AI to help select or generate thumbnail images?",
         "Are AI-generated captions or subtitles part of your content process?",
         "Do you experiment with AI-based visual effects or filters?",
         "Are you using AI tools to automate clip highlights for social media?",
         "Do you use AI to track viewer sentiment on social media platforms?",
         "Are AI dashboards used to monitor viewer engagement in real time?",
         "Do you use AI to recommend posting times or platforms?",
         "Are LLMs used to draft video descriptions or content outlines?",
         "Do you analyze feedback and reviews using NLP models?",
         "Are AI tools used for managing licensing or digital rights?",
         "Do you use AI to streamline influencer or collaboration decisions?",
         "Are AI insights shared across editorial or creative teams?",
         "Are AI-powered CRM or analytics platforms in use?",
         "Do you use AI to plan content release calendars based on trends?",
         "Are you testing generative AI tools for small-scale content ideation?",
         "Is AI involved in tracking competitor performance or virality trends?",
         "Are you training your creative team to use AI-powered tools?"
      ],
      "Tier 4":[
         "Are AI video editing tools used in your daily content workflow?",
         "Are you using AI to generate captions, titles, and keywords?",
         "Do you use AI to identify viral content topics or hashtags?",
         "Are you experimenting with AI voiceovers or avatars in content?",
         "Is AI helping you analyze audience drop-off and optimize format?",
         "Are you using AI-generated prompts for scriptwriting or ideation?",
         "Do you use AI to remove silence or filler words in videos?",
         "Are AI tools used for repurposing content across formats (reels, shorts)?",
         "Do you use AI to identify collaboration or partnership opportunities?",
         "Are AI-generated animations or storyboards part of your process?",
         "Do you A/B test AI-generated thumbnails or headlines?",
         "Are you using AI to automate performance reporting to brands/sponsors?",
         "Are LLMs helping with sponsorship proposals or brand decks?",
         "Are you using generative AI for concept art or post backgrounds?",
         "Are you integrating AI insights from analytics into your content planning?",
         "Are AI-powered tools used to enhance audio quality automatically?",
         "Are you tracking AI-generated versus human content performance?",
         "Are you training yourself/team to stay updated on new AI tools?",
         "Are you working on building your own AI tools for content automation?",
         "Are AI dashboards helping you decide platforms and timing for release?"
      ],
      "Tier 5":[
         "Are you developing or fine-tuning AI tools for content creators?",
         "Are you building LLM-based assistants for video scripting or planning?",
         "Have you built AI tools for audio cleanup or video post-production?",
         "Are you consulting studios on AI use for storytelling or editing?",
         "Are you training generative AI models for custom creative outputs?",
         "Are you developing AI plugins for Adobe Premiere, After Effects, etc.?",
         "Do you publish or teach about AI for media creators?",
         "Are you building datasets for niche video or audio genres?",
         "Have you worked on deepfake detection or media integrity tools?",
         "Are you designing AI-based emotion recognition from viewer feedback?",
         "Do you prototype AI-based interactive storytelling formats?",
         "Are you training LLMs for screenplay adaptation or structuring?",
         "Are you integrating AI into AR/VR or immersive content formats?",
         "Are you involved in crowdsourcing or federated AI tools for media?",
         "Are you testing generative AI for consistent brand visual identity?",
         "Are your tools compatible with YouTube, Instagram, or TikTok APIs?",
         "Do you create visualizations to explain AI models in media use?",
         "Do you benchmark different AI tools for creative quality and speed?",
         "Are you advising clients on content risk or copyright with AI?",
         "Do you contribute to open datasets or tools for the creative industry?"
      ]
   },
   "FMCG & Consumer Goods":{
      "Tier 1":[
         "Are AI tools used to automate basic inventory tracking at store level?",
         "Do you use simple chatbots to handle customer FAQs across channels?",
         "Is data collected digitally for future AI analysis of sales and demand?",
         "Are basic ML models piloted to forecast regional sales trends?",
         "Do you apply computer vision to monitor quality in packaging?",
         "Are loyalty program data analyzed using simple AI segmentation?",
         "Is AI used to optimize replenishment schedules on a limited scale?",
         "Do basic dashboards provide insight into consumer preferences?",
         "Is AI used to tag and categorize customer reviews automatically?",
         "Are generative AI tools tested for ad copy and packaging design?",
         "Is AI applied to monitor competitor pricing at local levels?",
         "Do you use predictive models for short-term inventory management?",
         "Are AI chatbots supporting multilingual customer interactions?",
         "Is basic AI used to recommend promotions and discounts?",
         "Are you experimenting with AI for supply chain visibility?",
         "Do AI models help identify slow-moving SKUs for discontinuation?",
         "Is image recognition tested to verify product labeling accuracy?",
         "Are ML models piloted for demand forecasting during sales events?",
         "Is AI applied to automate logistics route planning locally?",
         "Are analytics dashboards integrating sales and marketing data?"
      ],
      "Tier 2":[
         "Are predictive models used to forecast seasonal and regional product demand?",
         "Do ML models help decide optimal packaging sizes and bundles?",
         "Are AI tools used to identify underperforming SKUs for discontinuation?",
         "Are customer feedback and reviews analyzed for product refinement using NLP?",
         "Are product launch outcomes simulated using AI insights?",
         "Are returns and defects tracked using predictive AI models?",
         "Is inventory auto-replenishment driven by ML-powered demand forecasting?",
         "Do AI dashboards support sales and marketing teams with actionable insights?",
         "Are LLMs generating personalized copy for ads, emails, and packaging?",
         "Are visual merchandising decisions supported by AI heatmaps or A/B testing?",
         "Is generative AI used to propose new packaging or branding variations?",
         "Are POS data and consumer behavior used to create targeted promotions?",
         "Are you using AI to manage supplier quality and logistics risk?",
         "Do ML models suggest restocking timelines to prevent both shortages and overstock?",
         "Are price elasticity models powered by AI guiding pricing changes?",
         "Are your digital campaigns enhanced using AI-generated creatives?",
         "Do your operational teams use AI to monitor production efficiency?",
         "Are AI-powered chatbots deployed for post-sale customer service?",
         "Do product comparison engines use AI to enhance e-commerce offerings?",
         "Are AI models evaluating the carbon impact of product materials?"
      ],
      "Tier 3":[
         "Is sales data analyzed by AI tools to optimize restocking schedules?",
         "Are you using ML to identify top-selling SKUs across geographies?",
         "Do AI-generated trend reports help with product decisions?",
         "Are customer complaints tracked using sentiment analysis tools?",
         "Is AI used to reduce overstocking and markdown costs?",
         "Do you use computer vision to detect packaging defects in batches?",
         "Are marketing emails tailored using ML-driven segmentation?",
         "Are you automating basic operations with AI-driven tools (inventory, CRM)?",
         "Is NLP used to categorize and understand customer feedback?",
         "Are pricing models optimized based on AI-powered market analysis?",
         "Is AI used to forecast best sellers during festive or regional events?",
         "Do generative AI tools assist in creating new label or ad copy?",
         "Is delivery efficiency optimized using AI-powered logistics tracking?",
         "Do you use AI dashboards to view real-time inventory movement?",
         "Is your customer loyalty program enhanced using behavior prediction?",
         "Are generative tools used to simulate product shelf appearances?",
         "Is AI being used to target social media ads based on lookalike audiences?",
         "Are product images auto-enhanced with AI for e-commerce platforms?",
         "Is AI forecasting the impact of discount campaigns before launch?",
         "Are retail footfall predictions aiding sales strategy?"
      ],
      "Tier 4":[
         "Is AI used to analyze online customer behavior and preferences?",
         "Are product recommendations personalized using ML?",
         "Do generative AI tools assist with ad design and content creation?",
         "Are product descriptions generated using LLMs?",
         "Are you using AI to identify your most profitable customer segments?",
         "Is predictive AI used to recommend reorder cycles to users?",
         "Are abandoned carts retargeted using AI-based predictions?",
         "Are A/B tests run on pricing and promotions using AI insights?",
         "Do you analyze social media comments using sentiment AI?",
         "Are chatbot assistants resolving product and delivery questions?",
         "Are generative tools used to design new product variants?",
         "Are your influencer campaigns optimized with AI audience matching?",
         "Do you use visual AI to auto-tag products on your store?",
         "Are subscription plans personalized using usage trend AI?",
         "Are return rates analyzed with AI to improve product design?",
         "Do customer stories feed into product development via NLP tools?",
         "Is AI helping predict packaging needs based on sales growth?",
         "Are reviews clustered and analyzed for product iteration?",
         "Are images and content auto-generated for rapid product launches?",
         "Is AI a core part of your product innovation workflow?"
      ],
      "Tier 5":[
         "Do you use AI to forecast demand at SKU, store, and region levels in real-time?",
         "Are generative AI models used to create personalized marketing and ad content?",
         "Is computer vision used for quality control and defect detection in production lines?",
         "Are LLMs deployed for summarizing market research, consumer sentiment, and competitor analysis?",
         "Are AI-powered systems in place for dynamic pricing based on market conditions?",
         "Is AI integrated with supply chain optimization and inventory planning?",
         "Do you use AI to manage and monitor distributor/retailer performance?",
         "Are AI tools used to simulate new product launches and test virtual shelf placements?",
         "Is AI used for real-time competitor pricing and strategy analysis?",
         "Do you deploy AI models to predict product returns or churn risk?",
         "Are NLP tools used for automated customer feedback extraction and tagging?",
         "Do your chatbots use AI for multilingual, natural conversations across regions?",
         "Is AI integrated with IoT data for cold-chain logistics monitoring?",
         "Do you use AI to recommend product bundles or cross-sell suggestions in e-commerce?",
         "Are LLMs helping with internal process automation like legal, procurement, etc.?",
         "Are generative design tools powered by AI used for packaging innovation?",
         "Are sustainability and carbon-impact metrics driven by AI dashboards?",
         "Is AI helping model real-time advertising RoI across multiple touchpoints?",
         "Do you use AI in consumer loyalty prediction and retention modeling?",
         "Do you have a centralized AI innovation team with enterprise-wide oversight?"
      ]
   },
   "Public Sector / Government Services":{
      "Tier 1":[
         "Are AI tools used to digitize and route citizen applications?",
         "Do you use simple chatbots to answer common public queries?",
         "Is AI applied for record digitization and document classification?",
         "Are basic dashboards used to monitor department performance?",
         "Is AI used to forecast staffing needs for service centers?",
         "Do you use automated email sorting based on content analysis?",
         "Is AI helping to optimize scheduling of on-ground services?",
         "Are simple NLP models applied to sort public feedback?",
         "Do you have automated alerts for service delays or backlog?",
         "Are basic AI analytics used to identify popular service requests?",
         "Is AI used to identify fraud in small public schemes?",
         "Are automated reminders sent using AI-powered scheduling?",
         "Are simple image recognition tools used for ID verification?",
         "Is AI used to improve accessibility on e-governance portals?",
         "Do AI models predict application processing times?",
         "Are you piloting chatbots for handling multilingual interactions?",
         "Is sentiment analysis applied to social media related to governance?",
         "Do basic ML models help optimize resource allocation locally?",
         "Are AI-generated reports used for monthly performance review?",
         "Are you collecting digital data for future AI usage?"
      ],
      "Tier 2":[
         "Are AI-powered bots deployed across multiple citizen service channels?",
         "Do you use predictive analytics for fraud detection in welfare programs?",
         "Is facial recognition used for secure access to government facilities?",
         "Are NLP models applied to analyze large public grievance datasets?",
         "Do you use AI to optimize resource deployment in public services?",
         "Is AI used to forecast budget utilization and allocation needs?",
         "Do chatbots support multilingual interactions across departments?",
         "Are AI dashboards used for monitoring infrastructure projects?",
         "Is predictive modeling applied to forecast service demand spikes?",
         "Are satellite images analyzed by AI for urban planning?",
         "Is AI used to monitor compliance and policy adoption automatically?",
         "Do you use AI for dynamic routing of emergency response teams?",
         "Are fraud detection AI systems integrated into procurement workflows?",
         "Is AI deployed in traffic monitoring and violation detection?",
         "Do AI algorithms analyze public transport usage patterns?",
         "Are LLMs used to generate routine government correspondence?",
         "Is AI used to recommend policy changes based on data trends?",
         "Are voice assistants available in public call centers?",
         "Do you monitor environmental parameters with AI-enabled sensors?",
         "Is AI involved in managing citizen feedback loops actively?"
      ],
      "Tier 3":[
         "Are AI models used for predictive policy impact simulations?",
         "Do generative AI tools create automatic drafts for policy documents?",
         "Is AI integrated into large-scale automation for service delivery?",
         "Are biometrics AI deployed for national security checks?",
         "Do you have AI-based citizen sentiment dashboards in use?",
         "Is NLP used to extract insights from RTI and legal documents?",
         "Are disaster response and resource allocation AI-driven?",
         "Do you use LLMs for multilingual official document processing?",
         "Are AI-powered dashboards providing real-time governance KPIs?",
         "Is AI applied to optimize budget and expenditure monitoring?",
         "Are fraud and risk detected in grant disbursement using AI?",
         "Is AI used for proactive maintenance in public infrastructure?",
         "Do you leverage AI for large-scale public health monitoring?",
         "Are autonomous AI systems deployed to assist police or municipal workers?",
         "Is AI integrated into traffic and waste management systems?",
         "Are drone and satellite data analyzed for urban infrastructure by AI?",
         "Are AI-scored tenders and contracts part of procurement?",
         "Is AI optimizing citizen service center operations nationwide?",
         "Are LLM-powered virtual assistants deployed on government portals?",
         "Is there a dedicated AI innovation lab driving digital governance?"
      ],
      "Tier 4":[
         "Is AI deeply embedded in e-governance for predictive policy making?",
         "Are generative AI tools continuously drafting and simulating legislative texts?",
         "Is AI managing full lifecycle automation of complex citizen services?",
         "Do you use biometric AI extensively for national identity and security?",
         "Are deep learning models analyzing socio-economic datasets for governance?",
         "Is AI optimizing disaster response with real-time resource orchestration?",
         "Are NLP and LLMs driving multilingual government communications?",
         "Do AI-powered dashboards track national-scale health, education, and agriculture?",
         "Are AI and IoT fused for real-time city infrastructure management?",
         "Is AI used to automate fraud detection across multiple welfare schemes?",
         "Are autonomous vehicles or drones deployed for public service delivery?",
         "Are AI-based monitoring systems integrated into environmental regulation?",
         "Do you run AI-driven citizen engagement and policy feedback platforms?",
         "Is AI powering automated legal case management in public sector?",
         "Are national security threat detections augmented by AI models?",
         "Is AI enabling dynamic, data-driven budget reallocation nationally?",
         "Are smart contracts and blockchain integrated with AI governance?",
         "Do you measure governance success with AI-derived KPIs?",
         "Are large language models trained on public data supporting policy analysis?",
         "Is there an enterprise AI innovation hub in your government setup?"
      ],
      "Tier 5":[
         "Is AI used for predictive policy impact modeling and simulations?",
         "Are generative AI models utilized to draft public policy briefs or responses?",
         "Do you use AI to automate service delivery at scale (e.g., pension disbursement, taxation)?",
         "Is facial recognition and biometrics AI deployed in national security or immigration?",
         "Are AI-based citizen feedback systems active across departments?",
         "Are NLP models used to process public grievances or RTI applications?",
         "Is AI used in e-governance platforms to predict service delays or gaps?",
         "Do you use AI for disaster response, including forecasting and resource allocation?",
         "Are you using LLMs to support multilingual document understanding and communication?",
         "Do you have real-time AI dashboards showing performance across ministries?",
         "Is AI applied to track and forecast budget utilization?",
         "Are fraud detection systems AI-driven in welfare schemes or procurement?",
         "Are AI-powered camera systems used for traffic, waste, or water management?",
         "Is satellite and drone data analyzed using AI for infrastructure monitoring?",
         "Do public tenders incorporate AI-based scoring or eligibility checks?",
         "Is AI used to optimize citizen service centers (CSC) operations?",
         "Are LLMs helping to automate responses in public portals and chatbot systems?",
         "Are national-scale health, education, or agriculture programs AI-enhanced?",
         "Do you measure AIs impact using defined governance KPIs?",
         "Is there a centralized AI policy or AI innovation lab under your jurisdiction?"
      ]
   },
   "Automotive":{
      "Tier 1":[
         "Are AI models used for autonomous driving and ADAS systems?",
         "Do you employ digital twins of full vehicle systems using AI?",
         "Are predictive maintenance models applied at scale across fleets?",
         "Is generative AI used for rapid prototyping and design simulation?",
         "Are LLMs integrated into automotive manuals and diagnostics tools?",
         "Do AI-driven systems assist in crash prediction and safety testing?",
         "Is AI used for smart supply chain orchestration across global units?",
         "Are AI models predicting consumer trends and custom feature demand?",
         "Is robotic vision used for inline inspection in manufacturing?",
         "Are AI-based navigation and route optimization systems in use?",
         "Are you training proprietary AI models for driving behavior analysis?",
         "Is AI applied to optimize vehicle aerodynamics and material efficiency?",
         "Are NLP systems powering conversational AI in infotainment systems?",
         "Are AI models ensuring regulatory compliance across markets?",
         "Do your EV platforms use AI for battery management and range prediction?",
         "Are AI algorithms used for traffic data integration in urban planning?",
         "Is AI being applied to simulate crash scenarios for regulatory tests?",
         "Are LLMs generating reports from test data and sensor logs?",
         "Are quality defects predicted and resolved through AI at the line level?",
         "Do you have a centralized AI governance and ethics board?"
      ],
      "Tier 2":[
         "Are AI algorithms optimizing parts manufacturing and scheduling?",
         "Do you use AI for demand forecasting in OEM supply chains?",
         "Are vision-based AI systems implemented for product quality control?",
         "Is AI used for intelligent inventory and procurement decisions?",
         "Do your service centers use AI for diagnostics and repairs?",
         "Are LLM-based assistants used by technicians or engineers?",
         "Is AI used for warranty claims prediction and fraud detection?",
         "Are you using predictive analytics for part replacements or recalls?",
         "Are AI tools supporting marketing personalization for dealerships?",
         "Are chatbots used for lead management and test drive bookings?",
         "Do logistics systems use AI to track spare parts in transit?",
         "Is AI used in factory-floor robotics for welding, painting, and assembly?",
         "Are customer feedback and reviews analyzed using sentiment AI?",
         "Are AI simulations used for new part performance under stress?",
         "Is energy consumption optimized in plants using AI?",
         "Are call centers using voice AI for customer support in regional languages?",
         "Do you use AI to analyze service data across dealer networks?",
         "Are automatic job card and invoice generation systems AI-powered?",
         "Are predictive models integrated with ERP and MES platforms?",
         "Are AI tools helping with sustainability and emission reduction tracking?"
      ],
      "Tier 3":[
         "Are you using basic AI for supply-demand matching?",
         "Is AI used to forecast sales trends or seasonal demands?",
         "Are you implementing AI-based camera systems in quality checks?",
         "Is inventory optimization partially automated using AI tools?",
         "Are AI dashboards used to track production KPIs in real-time?",
         "Are NLP-based systems used to interpret service reports?",
         "Are WhatsApp or website chatbots used for customer support?",
         "Is pricing strategy informed using AI-powered market research tools?",
         "Are employee shift and machine utilization decisions AI-driven?",
         "Do you use AI to analyze procurement costs and alternatives?",
         "Is AI being used to improve warranty tracking and resolution time?",
         "Are predictive models alerting on potential component faults?",
         "Are marketing campaigns optimized using AI tools?",
         "Do you use AI for training technicians or staff using simulations?",
         "Are voice-based feedback systems powered by AI used in service centers?",
         "Do you use OCR and AI for invoice or document processing?",
         "Are AI models helping in local transportation or fleet planning?",
         "Are R&D teams exploring ML for component durability predictions?",
         "Are social media insights driving product development via AI?",
         "Is AI included in your company’s 5-year technology roadmap?"
      ],
      "Tier 4":[
         "Is AI part of your vehicle telematics and data analytics stack?",
         "Are you training ML models on real driving behavior or terrain data?",
         "Is AI used for energy efficiency optimization in EV powertrains?",
         "Do you use AI to analyze sensor fusion data from your vehicle prototypes?",
         "Is AI used for driver scoring or gamification in user apps?",
         "Are you building LLM-based user guides or service manuals?",
         "Are crash or impact tests simulated using AI models?",
         "Are you using AI to match users to financing or leasing options?",
         "Is route and charging station planning AI-enhanced?",
         "Do you use AI to compare competitors’ features and price strategies?",
         "Are camera feeds analyzed in real-time for driver safety features?",
         "Is AI generating real-time maintenance alerts via mobile apps?",
         "Are AI models used for remote diagnostics or OTA updates?",
         "Do you personalize driving experience using user preference AI?",
         "Are parts and material vendors ranked using AI analytics?",
         "Are generative design tools used to create auto body iterations?",
         "Is your product support chatbot powered by an LLM?",
         "Do you track test fleet performance with predictive ML?",
         "Are you using AI to recommend insurance or extended warranty plans?",
         "Is AI a core part of your go-to-market and investor pitch strategy?"
      ],
      "Tier 5":[
         "Are you working on perception models for lane, object, and pedestrian",
         "Are transformer-based models being tested for sensor fusion tasks?",
         "Are AI models trained on real-world driving datasets like Waymo/OpenPilot?",
         "Do you experiment with reinforcement learning for autonomous systems?",
         "Are GANs or other generative models used for synthetic test environments?",
         "Are you contributing to open datasets or benchmarks in automotive AI?",
         "Are you fine-tuning LLMs for onboard diagnostics and user manuals?",
         "Are AI algorithms being optimized for edge deployment in vehicles?",
         "Are driving pattern models being integrated with traffic and road conditions?",
         "Are you building custom middleware for real-time inference on in-car hardware?",
         "Are federated learning models being explored for shared mobility platforms?",
         "Are you working on explainable AI models for vehicle safety compliance?",
         "Are AI-driven simulators being built for virtual vehicle testing?",
         "Do you use AI to optimize real-time battery usage in EVs?",
         "Are computer vision models customized for Indian traffic conditions?",
         "Are NLP systems integrated into multilingual voice assistants for drivers?",
         "Are AI models being evaluated against ISO 26262 safety standards?",
         "Are LLMs powering interactive service manuals or driver tutorials?",
         "Are you integrating AI with blockchain for vehicle identity and history?",
         "Are you contributing to industry AI working groups or consortiums?"
      ]
   },
   "Environmental & Sustainability":{
      "Tier 1":[
         "Are AI models used for climate change prediction and simulation?",
         "Is satellite imagery analyzed using AI to monitor deforestation, oceans, and",
         "Are AI tools used for carbon credit validation and trading platforms?",
         "Is AI deployed in large-scale environmental impact assessments?",
         "Are you leveraging LLMs to create ESG reports and sustainability",
         "Are generative AI tools simulating green architecture and urban designs?",
         "Is AI used to optimize energy distribution from renewable sources?",
         "Do AI systems track global emissions across supply chains?",
         "Are biodiversity trends monitored using AI and IoT sensor fusion?",
         "Are AI systems used for climate adaptation and disaster resilience modeling?",
         "Is water scarcity mapping driven by AI-enabled satellite and sensor data?",
         "Are LLMs used for grant writing and policy lobbying around climate tech?",
         "Do your AI tools integrate data from IoT, climate models, and public sources?",
         "Are you using AI to optimize electric grid performance in real-time?",
         "Is AI powering prediction models for sustainable agriculture practices?",
         "Are digital twins used for eco-friendly industrial infrastructure?",
         "Is AI used in optimizing waste management in smart cities?",
         "Do you use ML for detecting environmental policy violations in real-time?",
         "Are sustainability-focused KPIs monitored using AI dashboards?",
         "Is AI included in your organization's global decarbonization strategy?"
      ],
      "Tier 2":[
         "Are AI tools used to analyze and reduce carbon footprint in operations?",
         "Is AI applied to monitor and forecast energy consumption patterns?",
         "Do AI systems manage solar, wind, and hydroelectric energy efficiency?",
         "Are AI tools used for detecting pollution levels using satellite and drone data?",
         "Are ML models optimizing HVAC systems for energy savings?",
         "Is AI used to create ESG dashboards for real-time reporting?",
         "Are AI-powered tools used to track sustainability metrics across plants?",
         "Are you using computer vision for environmental inspections?",
         "Is AI used in modeling green building designs and material usage?",
         "Are sustainability training materials generated using LLMs?",
         "Is AI used to benchmark performance against green certifications?",
         "Are AI systems analyzing supplier sustainability scores?",
         "Do you use AI to design circular economy supply chains?",
         "Are predictive analytics used to prevent environmental hazards?",
         "Are AI-powered sensors deployed for air and water quality monitoring?",
         "Do sustainability officers use LLMs for compliance documentation?",
         "Are AI models detecting anomalies in renewable energy generation?",
         "Are AI chatbots handling community engagement around green initiatives?",
         "Is smart irrigation in agriculture supported by AI predictions?",
         "Are internal tools using AI to simulate green product lifecycle impacts?"
      ],
      "Tier 3":[
         "Are AI dashboards used to monitor basic energy usage patterns?",
         "Do you use predictive tools for solar/wind energy generation forecasts?",
         "Is AI used for automating ESG reporting and documentation?",
         "Are low-cost AI sensors deployed for pollution detection?",
         "Do you use AI tools for grant applications or compliance filing?",
         "Are waste segregation systems AI-enabled at processing units?",
         "Are LLMs used to assist staff in writing environmental reports?",
         "Are AI models used to plan optimal transportation for green delivery?",
         "Do you monitor water use using IoT and basic AI analytics?",
         "Are AI models supporting carbon offset program calculations?",
         "Are drone feeds processed by AI to assess land usage and encroachment?",
         "Are AI tools analyzing regional climate data for site planning?",
         "Are energy bills and equipment usage logs optimized via AI?",
         "Are emissions and noise levels monitored using AI-integrated sensors?",
         "Are crop and land usage optimized using ML models?",
         "Is AI used to generate alerts for maintenance of green equipment?",
         "Are chatbot systems guiding users on energy conservation methods?",
         "Do you use vision-based AI for detecting trash overflow in bins?",
         "Are LLMs used to simplify environmental laws and regulations?",
         "Are you exploring AI pilot projects to support green certifications?"
      ],
      "Tier 4":[
         "Are AI models used for carbon footprint calculators on your platform?",
         "Is AI helping track and recommend sustainable behaviors to users?",
         "Are you building LLM-based policy suggestion tools for climate action?",
         "Is AI used to map supply chain emissions for SMEs and brands?",
         "Do your users receive AI-generated sustainability reports?",
         "Are computer vision tools analyzing satellite or street-level imagery for land",
         "Are AI simulations used to promote eco-design and sustainable product",
         "Do you use AI to personalize environmental tips based on user data?",
         "Are chatbots helping guide carbon offset purchase decisions?",
         "Are you using AI to match users with green incentives and subsidies?",
         "Are public data sources scraped and analyzed using AI for eco-research?",
         "Is energy use tracked in homes or offices using smart AI-driven devices?",
         "Are you building or using AI to track net-zero goals in real time?",
         "Is AI applied to evaluate packaging sustainability or reuse value?",
         "Are mobile apps integrating AI to reduce individual carbon footprints?",
         "Is AI used to optimize the recycling of e-waste or rare materials?",
         "Do your platforms provide AI-based risk mapping of environmental events?",
         "Are you using AI to manage decentralized energy systems?",
         "Is biodiversity impact modeled using open environmental datasets and ML?",
         "Do you have LLM integrations for climate-focused customer support?"
      ],
      "Tier 5":[
         "Are ML models developed for emissions forecasting at regional/global scales?",
         "Do you work on generative models for simulating climate impacts?",
         "Are deep learning models applied to satellite or drone image classification?",
         "Are you using transfer learning for species detection in conservation projects?",
         "Are LLMs fine-tuned to assist with climate policy and law research?",
         "Are edge AI systems built for real-time pollution monitoring in remote areas?",
         "Are AI-powered models used for flood, fire, or drought prediction?",
         "Are models trained to detect illegal mining, deforestation, or fishing?",
         "Are you contributing to open-source sustainability-focused AI tools?",
         "Are AI models helping optimize green hydrogen or alternative fuel production?",
         "Are your models using climate datasets like CMIP6, ERA5, or NASA Earthdata?",
         "Do you work with spatio-temporal modeling for land/water resource",
         "Are XAI (Explainable AI) techniques used for regulatory transparency?",
         "Are you using ensemble models for forecasting multiple environmental factors?",
         "Is AI being used for simulating carbon markets and pricing fluctuations?",
         "Are you using ML to identify ecosystem tipping points?",
         "Are AI models deployed on embedded systems for solar/wind farms?",
         "Are you integrating AI with blockchain for green supply chain traceability?",
         "Do you publish in journals like Nature Climate or IEEE GreenTech?",
         "Are your AI models validated using real-world environmental impact data?"
      ]
   },
   "Transportation & Logistics":{
      "Tier 1":[
         "Are AI models used to optimize global supply chain routing and schedules?",
         "Is AI integrated into autonomous logistics and fleet operations?",
         "Are digital twins powered by AI used for port and warehouse simulations?",
         "Are LLMs used for multimodal documentation, compliance, and translation?",
         "Do you use AI to optimize cross-border freight and customs clearance?",
         "Are machine learning models forecasting global demand and freight trends?",
         "Are AI systems integrated with blockchain for real-time cargo traceability?",
         "Are generative AI tools used to simulate new logistics network strategies?",
         "Is predictive maintenance for vehicles and ships fully AI-automated?",
         "Are smart contracts AI-verified for logistics and freight transactions?",
         "Are drone and aerial logistics routes optimized using AI?",
         "Are sustainability-focused logistics decisions powered by AI modeling?",
         "Are LLM-powered chatbots handling high-level customer service at scale?",
         "Is warehouse robotics driven by reinforcement learning algorithms?",
         "Is AI used for real-time optimization of delivery loads and fuel consumption?",
         "Do you leverage AI for climate risk mapping and route planning?",
         "Are IoT and AI fused for cold-chain logistics monitoring?",
         "Are predictive analytics used for freight capacity and congestion forecasting?",
         "Is AI used for pricing elasticity modeling in global shipping contracts?",
         "Are your board-level logistics decisions supported by AI-generated insights?"
      ],
      "Tier 2":[
         "Is AI used to optimize domestic route planning and delivery windows?",
         "Do you use computer vision for package detection and warehouse scanning?",
         "Is predictive maintenance powered by AI for your fleet vehicles?",
         "Are LLMs assisting in preparing and checking logistics documentation?",
         "Are warehouse operations optimized using AI-based load balancing?",
         "Are you using AI to reduce fuel costs through route optimization?",
         "Are demand forecasting models driving inventory and transportation?",
         "Is AI helping reduce dwell times at ports, hubs, or depots?",
         "Are sensors and AI used for environmental monitoring during transport?",
         "Are digital assistants powered by AI used for shipment tracking?",
         "Are customer service bots resolving real-time logistics queries?",
         "Are generative AI tools assisting with SLA and contract drafting?",
         "Do you apply AI to monitor driver behavior and enhance safety?",
         "Is AI analyzing warehouse camera feeds for security and efficiency?",
         "Are you leveraging AI to plan expansion of warehouse or delivery networks?",
         "Do your dashboards include predictive insights powered by ML?",
         "Are you using LLMs to generate multilingual shipment invoices and labels?",
         "Is AI used to detect bottlenecks in order fulfillment and last-mile delivery?",
         "Are truck-loading and space optimization guided by AI algorithms?",
         "Are your annual logistics strategy reports AI-augmented?"
      ],
      "Tier 3":[
         "Is AI used to track shipments and provide ETAs to customers?",
         "Are basic route optimization tools powered by AI or ML?",
         "Is predictive analytics used to improve delivery schedules?",
         "Do you use AI dashboards to track fleet fuel efficiency?",
         "Are AI tools helping reduce idle time for trucks or delivery personnel?",
         "Do you use ML to optimize pickup and delivery sequences?",
         "Are camera feeds analyzed using AI for basic warehouse surveillance?",
         "Is AI used to cluster customer locations for faster routing?",
         "Are chatbots providing shipment updates to customers?",
         "Are document templates generated using LLMs for invoicing or customs?",
         "Are AI-powered insights used to manage vehicle servicing schedules?",
         "Is AI used to suggest warehouse inventory redistribution?",
         "Do you analyze local traffic data using AI for dynamic rerouting?",
         "Are mobile apps powered by AI for delivery agents?",
         "Are delays and risks in local transport predicted using ML models?",
         "Are LLMs used to create standard operating procedures (SOPs)?",
         "Are AI-based tools helping with seasonal demand planning?",
         "Are delivery vehicle capacities optimized using simple ML models?",
         "Are customer feedback loops analyzed with sentiment AI?",
         "Are your logistics reports partially generated by AI tools?"
      ],
      "Tier 4":[
         "Are you building AI models for real-time logistics tracking?",
         "Is AI being used to enable hyperlocal deliveries and dynamic rerouting?",
         "Are you applying ML to optimize driver allocation and job dispatch?",
         "Are AI tools generating real-time pricing for on-demand deliveries?",
         "Are you building LLM-powered tools to automate customer support?",
         "Are you using AI to identify high-demand delivery zones and optimize",
         "Is predictive analytics helping you reduce delivery failure rates?",
         "Are digital twins used for simulating city-wide delivery networks?",
         "Are AI-based image processors helping verify delivered goods?",
         "Are you using generative AI to simulate peak delivery load scenarios?",
         "Are LLMs powering logistics intelligence chatbots for staff?",
         "Are AI models optimizing cold-chain transport in food or pharma?",
         "Are you leveraging public data for AI-based supply chain insights?",
         "Are route heatmaps and delivery congestion data generated by AI?",
         "Are you applying AI to reduce delivery carbon footprints?",
         "Is warehouse space utilization tracked by AI visual systems?",
         "Do your apps provide AI-powered insights to drivers or fleet managers?",
         "Are smart lockers or drones managed by AI algorithms?",
         "Are you exploring edge AI for real-time fleet control?",
         "Is your business model integrating AI as a core differentiator?"
      ],
      "Tier 5":[
         "Are you building reinforcement learning models for delivery dispatch?",
         "Are deep learning models applied to traffic camera and drone data?",
         "Do your models fuse GPS, traffic, and weather data for predictions?",
         "Are anomaly detection models used for fraud or package tampering?",
         "Are LLMs fine-tuned to generate real-time multilingual logistics messages?",
         "Are you contributing to AI frameworks for urban transport optimization?",
         "Are AI algorithms used for hub-and-spoke route design?",
         "Are your models trained on real-time fleet telemetry data?",
         "Are you using transfer learning for vehicle image classification?",
         "Are your ML models optimizing LTL (Less-than-truckload) consolidation?",
         "Are AI-powered OCR systems used for invoice and bill of lading parsing?",
         "Are Bayesian models used for risk assessment in delivery networks?",
         "Are neural networks helping forecast congestion at logistics hubs?",
         "Are you building edge AI tools for vehicle-mounted devices?",
         "Do your models predict perishable item deterioration during transport?",
         "Are you exploring CV + NLP fusion for logistics document processing?",
         "Are deep RL agents managing robotic warehouse movements?",
         "Are AI models contributing to CO2 impact dashboards for fleets?",
         "Are you deploying ML models on federated logistics data across partners?",
         "Are AI solutions you develop integrated into smart city traffic systems?"
      ]
   },
   "Food & Beverage":{
      "Tier 1":[
         "Is AI used to monitor production line efficiency in real-time?",
         "Do you use basic predictive models to forecast local ingredient demand?",
         "Are AI-powered quality checks applied to final packaged products?",
         "Is AI used for basic inventory tracking and shelf-life management?",
         "Do you use chatbots or voice assistants for customer service queries?",
         "Are digital sensors integrated for temperature and humidity monitoring?",
         "Is AI applied to automate scheduling and workforce optimization?",
         "Are basic ML models used to optimize delivery routes locally?",
         "Is AI used to support compliance with food safety regulations?",
         "Are you collecting data digitally for future AI analysis?",
         "Do you use automated systems for waste tracking and reduction?",
         "Are you using AI to detect anomalies in production data?",
         "Is AI-powered packaging machinery used at any stage?",
         "Do you have basic dashboards to view production KPIs?",
         "Are AI-based alerts set for equipment maintenance needs?",
         "Do small-scale generative AI tools assist in marketing content?",
         "Is AI used to monitor supplier compliance at a basic level?",
         "Are you piloting AI-based process improvements in limited areas?",
         "Are basic NLP tools used to analyze customer feedback?",
         "Is AI involved in tracking allergen labeling accuracy?"
      ],
      "Tier 2":[
         "Are ML models predicting seasonal ingredient demand variations?",
         "Do AI tools optimize production batch sizes and schedules?",
         "Are computer vision systems used to detect packaging defects?",
         "Is AI used for nutrient content analysis and optimization?",
         "Are predictive models forecasting shelf-life and spoilage at scale?",
         "Do you automate product labeling and traceability with AI?",
         "Are AI-powered robots used in packaging or sorting operations?",
         "Do chatbots handle multi-language customer support efficiently?",
         "Is real-time energy consumption optimized with AI in factories?",
         "Are you using AI to model sustainability impacts of packaging choices?",
         "Does AI predict demand for new product variants or recipes?",
         "Do AI dashboards integrate production, quality, and sales data?",
         "Are generative AI tools used in recipe innovation and testing?",
         "Is waste management driven by predictive analytics?",
         "Are smart sensors used for continuous quality measurement?",
         "Are you leveraging AI for supplier risk assessment?",
         "Is AI used to simulate supply chain logistics under disruptions?",
         "Are trend forecasting models used to predict consumer preferences?",
         "Do your marketing teams use AI-generated campaign content?",
         "Are anomaly detection models active for food safety alerts?"
      ],
      "Tier 3":[
         "Are AI models optimizing procurement budgets and supplier mix?",
         "Do you use digital twins to simulate manufacturing plant workflows?",
         "Is AI involved in automated compliance documentation and reporting?",
         "Do AI-based vision systems classify ingredients by quality grade?",
         "Are ML models forecasting maintenance needs and reducing downtime?",
         "Is real-time demand sensing integrated with production planning?",
         "Are advanced chatbots assisting with product inquiries and orders?",
         "Do you automate returns and spoilage management with AI?",
         "Is AI used to design personalized nutrition products or recipes?",
         "Are computer vision solutions used in warehouse inventory control?",
         "Do predictive analytics models guide pricing strategies?",
         "Are AI systems used to forecast product launch success?",
         "Is sustainability reporting automated and AI-driven?",
         "Do AI-generated insights feed executive-level decision making?",
         "Are you piloting robotics for flexible packaging operations?",
         "Is customer sentiment analysis integrated into product development?",
         "Are you using reinforcement learning to optimize production parameters?",
         "Is AI helping to reduce waste in raw materials sourcing?",
         "Are cross-functional AI models used to optimize the cold chain?",
         "Do AI-powered dashboards support multi-site performance comparisons?"
      ],
      "Tier 4":[
         "Are AI-powered supply chain control towers managing end-to-end flow?",
         "Do generative AI models co-create new product lines routinely?",
         "Is AI used to customize product formulations by region and consumer?",
         "Are digital twins used to optimize factory floor layouts dynamically?",
         "Is multi-modal AI used for ingredient quality prediction and control?",
         "Do you use AI for real-time consumer feedback integration?",
         "Are AI-driven logistics platforms dynamically routing cold-chain shipments?",
         "Is NLP used to automate regulatory compliance assessment globally?",
         "Are robotics with embedded AI managing full production lines?",
         "Do AI-driven trend engines continuously identify emerging flavors?",
         "Are AI models integrated for ESG impact assessments?",
         "Is generative design applied to innovative sustainable packaging?",
         "Do AI-powered recommendation engines guide sales and distribution?",
         "Is AI embedded in ERP and SCM for predictive supply adjustments?",
         "Are voice assistants and chatbots fully integrated into customer care?",
         "Do you deploy reinforcement learning for energy and resource optimization?",
         "Are comprehensive AI scenarios used for executive risk analysis?",
         "Is AI used to model global consumer preferences and forecast demand?",
         "Are blockchain and AI combined for full supply chain traceability?",
         "Is AI a core component of your innovation and R&D workflows?"
      ],
      "Tier 5":[
         "Is AI integrated across the supply chain to optimize sourcing, production, and delivery globally?",
         "Are AI models used to forecast global ingredient demand and procurement strategy?",
         "Do you use generative AI for new product development and recipe simulations?",
         "Are LLMs assisting in multilingual compliance, nutrition labeling, and marketing?",
         "Are smart factories driven by AI for real-time process adjustments and quality assurance?",
         "Do predictive analytics models manage shelf-life, spoilage, and inventory optimizations?",
         "Are computer vision systems monitoring food packaging quality at scale?",
         "Are AI-based robotics used for autonomous packaging and sorting?",
         "Are chatbots and voice assistants powered by LLMs handling global customer support?",
         "Is AI used to optimize energy consumption in food manufacturing plants?",
         "Are AI insights integrated with sustainability and ESG reporting?",
         "Are dynamic pricing strategies driven by AI in your retail and D2C channels?",
         "Are AI tools forecasting global food trends and consumer preferences?",
         "Do your logistics networks leverage AI for cold chain optimization?",
         "Is computer vision used for visual inspection of raw materials?",
         "Are digital twins of manufacturing plants used for capacity simulation?",
         "Is NLP used to analyze global consumer feedback and sentiment?",
         "Do you use AI to test new packaging materials and predict shelf impact?",
         "Are your executive decisions driven by AI-powered dashboards?",
         "Are AI models used in fraud detection for product authenticity?"
      ]
   },
   "Consumer Goods":{
      "Tier 1":[
         "Is AI integrated across your global product lifecycle management?",
         "Are generative AI tools used to co-create new product designs and packaging?",
         "Are LLMs supporting legal, marketing, and compliance documentation at scale?",
         "Is AI used to personalize global marketing campaigns by region and",
         "Are demand forecasts driven by real-time data from global markets and social",
         "Are AI-powered visual inspection systems used for quality assurance in",
         "Do digital twins simulate production line performance and product logistics?",
         "Are AI-driven sustainability models influencing packaging and material",
         "Are robots with embedded AI used in warehouse and manufacturing",
         "Is AI used to dynamically adjust pricing in multiple markets?",
         "Are AI-powered chatbots resolving consumer queries in multiple languages?",
         "Are customer sentiment models driving product innovation feedback loops?",
         "Is AI integrated into omnichannel retail analytics and optimization?",
         "Are intelligent ERP systems using AI for supply-demand balancing?",
         "Are loyalty programs hyper-personalized using ML-based segmentation?",
         "Do you use AI to predict and manage product recalls or risk issues?",
         "Are AI-generated insights part of quarterly executive strategy meetings?",
         "Is predictive AI used to reduce overproduction and waste?",
         "Are AI-driven trend engines tracking lifestyle shifts and consumer habits?",
         "Are smart sensors and IoT data fused with AI for in-market performance?"
      ],
      "Tier 2":[
         "Are predictive models used to forecast seasonal and regional product demand?",
         "Do ML models help decide optimal packaging sizes and bundles?",
         "Are AI tools used to identify underperforming SKUs for discontinuation?",
         "Are customer feedback and reviews analyzed for product refinement using NLP?",
         "Are product launch outcomes simulated using AI insights?",
         "Are returns and defects tracked using predictive AI models?",
         "Is inventory auto-replenishment driven by ML-powered demand forecasting?",
         "Do AI dashboards support sales and marketing teams with actionable insights?",
         "Are LLMs generating personalized copy for ads, emails, and packaging?",
         "Are visual merchandising decisions supported by AI heatmaps or A/B testing?",
         "Is generative AI used to propose new packaging or branding variations?",
         "Are POS data and consumer behavior used to create targeted promotions?",
         "Are you using AI to manage supplier quality and logistics risk?",
         "Do ML models suggest restocking timelines to prevent both shortages and",
         "Are price elasticity models powered by AI guiding pricing changes?",
         "Are your digital campaigns enhanced using AI-generated creatives?",
         "Do your operational teams use AI to monitor production efficiency?",
         "Are AI-powered chatbots deployed for post-sale customer service?",
         "Do product comparison engines use AI to enhance e-commerce offerings?",
         "Are AI models evaluating the carbon impact of product materials?"
      ],
      "Tier 3":[
         "Is sales data analyzed by AI tools to optimize restocking schedules?",
         "Are you using ML to identify top-selling SKUs across geographies?",
         "Do AI-generated trend reports help with product decisions?",
         "Are customer complaints tracked using sentiment analysis tools?",
         "Is AI used to reduce overstocking and markdown costs?",
         "Do you use computer vision to detect packaging defects in batches?",
         "Are marketing emails tailored using ML-driven segmentation?",
         "Are you automating basic operations with AI-driven tools (inventory, CRM)?",
         "Is NLP used to categorize and understand customer feedback?",
         "Are pricing models optimized based on AI-powered market analysis?",
         "Is AI used to forecast best sellers during festive or regional events?",
         "Do generative AI tools assist in creating new label or ad copy?",
         "Is delivery efficiency optimized using AI-powered logistics tracking?",
         "Do you use AI dashboards to view real-time inventory movement?",
         "Is your customer loyalty program enhanced using behavior prediction?",
         "Are generative tools used to simulate product shelf appearances?",
         "Is AI being used to target social media ads based on lookalike audiences?",
         "Are product images auto-enhanced with AI for e-commerce platforms?",
         "Is AI forecasting the impact of discount campaigns before launch?",
         "Are retail footfall predictions aiding sales strategy?"
      ],
      "Tier 4":[
         "Is AI used to analyze online customer behavior and preferences?",
         "Are product recommendations personalized using ML?",
         "Do generative AI tools assist with ad design and content creation?",
         "Are product descriptions generated using LLMs?",
         "Are you using AI to identify your most profitable customer segments?",
         "Is predictive AI used to recommend reorder cycles to users?",
         "Are abandoned carts retargeted using AI-based predictions?",
         "Are A/B tests run on pricing and promotions using AI insights?",
         "Do you analyze social media comments using sentiment AI?",
         "Are chatbot assistants resolving product and delivery questions?",
         "Are generative tools used to design new product variants?",
         "Are your influencer campaigns optimized with AI audience matching?",
         "Do you use visual AI to auto-tag products on your store?",
         "Are subscription plans personalized using usage trend AI?",
         "Are return rates analyzed with AI to improve product design?",
         "Do customer stories feed into product development via NLP tools?",
         "Is AI helping predict packaging needs based on sales growth?",
         "Are reviews clustered and analyzed for product iteration?",
         "Are images and content auto-generated for rapid product launches?",
         "Is AI a core part of your product innovation workflow?"
      ],
      "Tier 5":[
         "Are deep learning models used for product recognition across e-commerce",
         "Is computer vision used for automated defect classification in production?",
         "Are LLMs trained on brand-specific tone and content generation?",
         "Are you deploying reinforcement learning for pricing strategy experiments?",
         "Is time series forecasting used for SKU-level inventory planning?",
         "Are your product simulations based on AI-driven physics or chemistry models?",
         "Are transformers used for cross-market product sentiment classification?",
         "Is ML integrated into robotic product pick-and-place automation?",
         "Are generative models used to co-design packaging or visuals?",
         "Are anomaly detection systems implemented for operational insights?",
         "Are you building AI models to simulate consumer trend impact?",
         "Are APIs developed to integrate AI tools into legacy PLM/ERP systems?",
         "Is multimodal AI used to combine visual, textual, and sales data for insights?",
         "Are GNNs (Graph Neural Networks) used for supply network optimization?",
         "Are ensemble models used to predict product bundling performance?",
         "Is edge AI used in production machinery for real-time corrections?",
         "Are your feedback systems structured to retrain AI models frequently?",
         "Are GANs explored for augmented product photography?",
         "Is product taxonomy maintained through AI-driven clustering?",
         "Are AI research outputs published or integrated into your IP pipeline?"
      ]
   },
   "Information Technology":{
      "Tier 1":[
         "Are AI models embedded in enterprise platforms to enable hyperautomation?",
         "Are LLMs fine-tuned and deployed internally for productivity and development",
         "Are self-healing systems and AI-driven observability part of your IT operations?",
         "Do you use AI to drive enterprise architecture modernization and planning?",
         "Are AI-powered code review and security tools integrated in DevOps pipelines?",
         "Do your products feature AI co-pilots or assistant layers for users?",
         "Is AI used to personalize user experiences at scale across global platforms?",
         "Are predictive AI engines managing data center and cloud resource allocation?",
         "Do you use AI for dynamic load balancing and failover management?",
         "Are internal knowledge bases powered by generative AI and RAG (retrieval-",
         "Are you using AI to reduce energy usage and carbon footprint in IT infrastructure?",
         "Are AI-generated reports part of leadership decision-making dashboards?",
         "Do AI systems auto-resolve incidents before they reach customers?",
         "Are product roadmaps influenced by AI-generated market and competitor",
         "Are multilingual LLMs used to support global client services?",
         "Are AI-driven threat intelligence models integrated into cybersecurity defenses?",
         "Are edge AI systems part of your deployment strategies for IoT and smart",
         "Is AI embedded in your QA/test automation frameworks?",
         "Do you build proprietary AI models to augment or replace third-party APIs?",
         "Is your AI capability a competitive differentiator across global markets?"
      ],
      "Tier 2":[
         "Do your products or services offer AI-powered features like chatbots or",
         "Are ML models used for project risk and resource optimization?",
         "Are AI assistants used by employees to generate documentation or code?",
         "Are anomaly detection systems monitoring your infrastructure?",
         "Are client-facing reports enhanced with AI-generated insights?",
         "Are predictive analytics integrated into client dashboards or admin panels?",
         "Are internal training platforms powered by personalized AI learning paths?",
         "Are AI models used for forecasting client demand and resource allocation?",
         "Are auto-remediation scripts deployed using AI-powered triggers?",
         "Is AI helping you classify and triage incoming customer support requests?",
         "Are generative tools used to create mockups, proposals, or user stories?",
         "Are AI-driven testing suites reducing QA cycles?",
         "Are predictive analytics used for IT asset lifecycle management?",
         "Are NLP models used to analyze RFPs or client requirements?",
         "Are code completion and generation tools used across dev teams?",
         "Are internal KPIs monitored using AI-powered dashboards?",
         "Are intelligent workflows embedded in ticketing and ITSM tools?",
         "Is customer sentiment from feedback loops analyzed using AI?",
         "Are bots used for release notes generation or product updates?",
         "Do product teams experiment with AI-enhanced user journeys?"
      ],
      "Tier 3":[
         "Are LLM-based copilots or assistants being explored for development or",
         "Are AI tools used to generate bug reports or sprint documentation?",
         "Are anomaly detection models integrated into application monitoring?",
         "Is customer churn being predicted using ML models?",
         "Are you exploring generative AI tools for marketing, proposals, or product copy?",
         "Do you use AI for classifying incoming support tickets?",
         "Are product analytics dashboards enhanced with predictive features?",
         "Are internal workflows automated using AI bots or smart triggers?",
         "Are ML models being used for feature usage and retention insights?",
         "Are your DevOps pipelines enhanced by AI-powered testing tools?",
         "Are your landing pages or ads generated or A/B tested using AI?",
         "Are you using AI to personalize onboarding for users?",
         "Are NLP models helping process support emails and chat queries?",
         "Are you analyzing user reviews and bug reports with sentiment AI?",
         "Are you using GPTs or custom LLMs to summarize documentation?",
         "Is AI helping optimize your infrastructure costs (e.g., cloud autoscaling)?",
         "Are bug trends and feature requests analyzed using unsupervised AI models?",
         "Are AI-generated visuals and UI components part of your design workflow?",
         "Are predictive models used to estimate delivery timelines or bottlenecks?",
         "Are clients receiving personalized insights based on their usage behavior?"
      ],
      "Tier 4":[
         "Are GPT-based tools used to generate or refactor code?",
         "Are AI-powered UI builders or assistants helping prototype products?",
         "Are product roadmaps informed by AI-driven customer behavior insights?",
         "Do you use no-code AI tools to enhance your feature development?",
         "Are you experimenting with AI-generated emails or social media content?",
         "Are generative design tools part of your UX/UI stack?",
         "Do you use AI to create test cases or improve CI/CD cycles?",
         "Are you implementing AI-based recommendations in your product?",
         "Are low-latency AI APIs part of your backend services?",
         "Are NLP features (e.g., summarization, translation) offered to users?",
         "Are you leveraging vector databases and embeddings for internal search?",
         "Do you use AI to identify and prioritize bugs from logs?",
         "Are predictive models helping you choose pricing plans?",
         "Are chatbot assistants part of your user support?",
         "Do you use AI-based AB testing engines for growth hacking?",
         "Are feedback loops automatically fed into product iterations using AI?",
         "Are analytics enriched with LLM-generated insights or summaries?",
         "Do you use speech-to-text or text-to-speech APIs for accessibility?",
         "Are you fine-tuning or customizing open-source models for niche use cases?",
         "Is your codebase getting AI-augmented performance suggestions?"
      ],
      "Tier 5":[
         "Are transformer-based models deployed for production inference workloads?",
         "Do you implement CI/CD pipelines specifically for ML/AI model deployment?",
         "Are you using LangChain, RAG, or similar tools for app development?",
         "Are you fine-tuning open-source LLMs on domain-specific data?",
         "Is feature store engineering part of your ML pipeline?",
         "Are deep learning frameworks like PyTorch or TensorFlow part of your stack?",
         "Are you developing scalable inferencing systems with Triton, ONNX, or similar?",
         "Are embeddings and vector stores used in retrieval-augmented systems?",
         "Are you implementing prompt engineering at scale for LLM performance?",
         "Are MLOps frameworks (MLFlow, Kubeflow) used for model tracking and",
         "Are multimodal models integrated with visual and textual pipelines?",
         "Are you implementing quantization, pruning, or distillation techniques?",
         "Do you use GPU/TPU acceleration for real-time workloads?",
         "Are you training or benchmarking open-source foundation models?",
         "Are you experimenting with GNNs, VAEs, or cutting-edge AI architectures?",
         "Are observability and logging systems tailored for AI failure cases?",
         "Is active learning being used to improve model labeling over time?",
         "Are you building your own LLM agents with long-context memory?",
         "Is RLHF or custom feedback loop training part of your experimentation?",
         "Are you exploring integrations between AI systems and blockchain or Web3?"
      ]
   }
}
